{


/* :::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::: */
/* ::                                    :: */
/* ::   dP""b8 88 888888 888888 .dP"Y8   :: */
/* ::  dP   `" 88 88__     88   `Ybo."   :: */
/* ::  Yb  "88 88 88""     88   o.`Y8b   :: */
/* ::   YboodP 88 88       88   8bodP'   :: */
/* ::                                    :: */
/* :::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::: */


"Antoine.gift.love.1.1": "Oh! This is great! Thank you!$h",
"Antoine.gift.like.1.1": "Oh this is very nice. Thank you.$0",
"Antoine.gift.dislike.1.1": "You're giving this to me? Um. Okay. Thank you.$0",
"Antoine.gift.hate.1.1": "Um. I don't really know what I'd do with this. Thanks anyway though.$s",
"Antoine.gift.neutral.1.1": "Is this a gift? That's very nice of you. Thank you.$0",

"Antoine.gift.love.2": "What a wonderful present! Thanks!$h",
"Antoine.gift.like.2": "This is a very nice present. Thank you for thinking of me.$0",
"Antoine.gift.dislike.2": "Is that a present? Thanks, I'll, uh, I'll find a use for it. Probably.$0",
"Antoine.gift.hate.2": "... Maybe next time you could give me something else? Sorry.$s",
"Antoine.gift.neutral.2": "Oh, for me? That's so nice. Thank you.$0",

//[280] - Loved
"Antoine.gift.yam.1": "A yam? Thanks, @! This is my favorite snack! They're just so versatile!$h",

//[416] - Loved
"Antoine.gift.snowyam.1": "Ah, the snow yam. A little more bitter than the yam you grow in the fall, but still tasty. Thank you! You really made my day.$h",

//[492] - Liked
"Antoine.gift.yamseeds.1": "Yam seeds! I've been needing more of these. Thank you!$h",

//[Book_QueenOfSauce] - Loved
"Antoine.gift.queenofsauce.1": "A cook book from the Queen of Sauce herself! I can't wait to try every one of these recipes! Thank you!$h",

//[457] - Neutral
"Antoine.gift.palebroth.1": "Marnie definitely ... well she um ... she really tried her best.$0",

//[222] - Liked
"Antoine.gift.rhubarbpie.1": "Marnie makes an interesting pie! Putting rhubarb in it is really clever.$h",

//[243] - Liked
"Antoine.gift.minerstreat.1": "You really wouldn't know there's cave carrots in it just by looking at it. Maybe this can be a sneaky way to get the kids to eat some vegetables. Then again, the amount of sugar in it probably overrides any health benefits.$h",

//[197] - Neutral
"Antoine.gift.cheesecauliflower.1": "Man, Pam really likes putting cheese on things that would be pretty healthy otherwise.$h",

//[239] - Liked
"Antoine.gift.stuffing.1": "This one actually smells really good. Did Pam adapt this from a TV dinner? Well I'd say she definitely improved it!$h",

//[234] - Liked
"Antoine.gift.blueberrytart.1": "This tart was very tasty. I'm surprised Pierre didn't make you pay for the recipe though. You'll have to let me know if he gives you anymore freebies!$h",

//[236] - Neutral
"Antoine.gift.pumpkinsoup.1": "This soup is really nice, but sort of bland if you don't add more than just pumpkin and milk. Robin definitely seems to like things bland, huh?$h",

//[218] - Liked
"Antoine.gift.tomkhasoup.1": "Oh! A recipe from Sandy! It's so interesting! It's pretty tasty too.$h",

//[215] - Neutral
"Antoine.gift.pepperpoppers.1": "Peppers fried with cheese inside. That does sound like the sort of spicy greasy thing Shane enjoys. I heard he eats of lot of rich greasy foods for breakfast.$h",

//[203] - Neutral
"Antoine.gift.strangebun.1": "Uh. The recipe you sent me from Shane has ... a unique ingredient. I almost didn't get my hands on it. I'm sure they're just fine. I'll. Definitely try one later. After you.$h",

//[727] - Loved
"Antoine.gift.chowder.1": "Willy is such a good cook. He almost gives Gus a run for his money. I like to add some potato to my chowder, but this was really nice as is.$h",

//[729] - Neutral
"Antoine.gift.escargot.1": "Soak snails in some butter and you've got a tasty treat. Sort of. You have a buttery one anyway. I wasn't sure if you were supposed to cook them with the shells on or not.$h",

//[728] - Liked
"Antoine.gift.fishstew.1": "This stew is so hardy matey! Arrr! Um. Sorry. Was that a bit much?$h",

//[210] - Liked
"Antoine.gift.hashbrowns.1": "You really can't miss when you fry a potato! The way the Queen of the Sauce does it is really interesting too! I got them extra golden for you.$h",

//[198] - Loved
"Antoine.gift.bakedfish.1": "I saw a rerun of Queen of Sauce where she shared a baked fish recipe that I just had to try! I even caught the fish myself so it'd be extra fresh.$h",

//[201] - Loved
"Antoine.gift.completebreakfast.1": "I finally caught a new Queen of the Sauce and she made a complete breakfast!. She's just amazing. Everyone needs a complete breakfast. Especially you with all the work you do.$h",

//[204] - Loved
"Antoine.gift.luckylunch.1": "I'm feeling extra lucky today because I made the Queen of Sauce's Lucky Lunch! I hope you feel lucky today too!$h",

//[229] - Loved
"Antoine.gift.tortilla.1": "The second I saw you sent me this tortilla recipe I just had to hunt down the Queen of Sauce episode that it came from. It definitely didn't disappoint!$h",

//[206] - Loved
"Antoine.gift.pizza.1": "The Queen of Sauce made a whole pizza on her show! I usually don't care for a lot of cheese, but hers looked so good! I hope mine looks good too.$h",

//[211] - Loved
"Antoine.gift.pancakes.1": "Pancakes are so good! The recipe the Queen shared makes them so fluffy I just had to go outside right away and find a bunch of berries to eat with it. Uh, I didn't really include the berries with yours. I sort of ate them all.$h",

//[209] - Neutral
"Antoine.gift.carpsurprise.1": "Um, usually the Queen knocks it out of the park, but this one was actually a bit bland? I guess that was the surprise.$h",

//[208] - Loved
"Antoine.gift.glazedyams.1": "Yams! The Queen used yams on her show! Aaah, I'm so happy! I love yams! The glaze makes them extra tasty too.$h",

//[610] - Loved
"Antoine.gift.fruitsalad.1": "This one is simple to make, but it's such a good use of summer fruits! The Queen of Sauce never ceases to amaze me.$h",

//[606] - Loved
"Antoine.gift.stirfry.1": "The cave carrots really put this stir fry on a whole new level. The Queen even had great tips on how to keep the rice fluffy!$h",

//[604] - Neutral
"Antoine.gift.plumpudding.1": "The Queen really did make a classic seasonal treat, didn't she? I'm not sure why it only get eaten in the winter though. The plums aren't really that fresh by then.$h",

//[651] - Loved
"Antoine.gift.poppyseedmuffin.1": "Shane warned me that if I eat these I could get in trouble if I want to get a job. It was a confusing conversation, but the muffins turned out tasty!$h",

//[219] - Neutral
"Antoine.gift.troutsoup.1": "I mean, you can't really blame the Queen for this one. Trout soup? What was bound to be pretty salty. I don't mind the texture, but I heard it makes some people gag. So be careful!$h",

//[611] - Loved
"Antoine.gift.blackberrycobbler.1": "Aaah, the Queen made me so nostalgic with this recipe. A blackberry cobbler really is a slice of home for me. I'd see the older ladies putting all kinds of different fruits in this. Peach was my absolute favorite.$h",

//[648] - Loved
"Antoine.gift.coleslaw.1": "This coleslaw is a lot lighter than what I saw back at home. The older ladies used way more mayonnaise. I really like the Queen's version though. It's crisp.$h",

//[731] - Neutral
"Antoine.gift.maplebar.1": "Phew! I almost didn't manage to make this one. The Queen of Sauce makes it look so easy, but it's really not! I think my maple bar is a little chewier than it's supposed to be.$h",

//[220] - Loved
"Antoine.gift.chocolatecake.1": "This recipe made so much cake! The Queen really likes to indulge for the holidays, huh? The chocolate made this extra rich, so maybe don't eat the whole thing at once like I've seen you do with other stuff.$h",

//[730] - Neutral
"Antoine.gift.lobsterbisque.1": "Wow, it's crazy how the Queen's recipe for lobster bisque tastes just like Willy's. I'm sure it's just a coincidence.$h",

//[732] - Loved
"Antoine.gift.crabcakes.1": "Man, the smell of these crab cakes really brought me back. I used to see people frying these all the time. Thanks to the Queen of Sauce I finally get to try some! And you do too!$h",

//[609] - Neutral
"Antoine.gift.radishsalad.1": "Radishes have an interesting sort of spiciness to them, don't they? It doesn't burn like a hot pepper does. The vinegar really makes these shine though! The Queen is so smart.$h",

//[228] - Loved
"Antoine.gift.makiroll.1": "I saw Gus selling this recipe at the saloon. I wonder if his tastes like the Queen's does? It's definitely my favorite way to eat fish!$h",

//[221] - Loved
"Antoine.gift.pinkcake.1": "The Queen of Sauce made this cake look so cute! I tried to follow along, but I think I sort of botched it. Oh well, it still tastes great!$h",

//[608] - Loved
"Antoine.gift.pumpkinpie.1": "This really feels like it'd be a great fall treat. The spices the Queen recommended takes this to a whole new level. I'm actually pretty proud of this one.$h",

//[618] - Loved
"Antoine.gift.bruschetta.1": "Nothing is better than when bread gets crunchy and you can spread things on it. The Queen's roasted tomatoes are just great on it! You should pair this with a nice drink too.$h",

//[605] - Neutral
"Antoine.gift.artichokedip.1": "I knew you could make a dip from onions, but artichokes? It's surprisingly tasty! The Queen said you should get this with chips for extra salt and crunch.$h",

//[649] - Loved
"Antoine.gift.fiddleheadrisotto.1": "Risotto is so hard! I wasted so much garlic just making it over and over again. I really don't know how the Queen of Sauce managed to make hers so fast.$h",

//[216] - Loved
"Antoine.gift.bread.1": "I think my favorite thing to do with bread is make sandwiches. The Queen's bread is extra crusty too, I could eat it with just a little butter. I'm interested in what you're going to do with yours!$h",

//[607] - Loved
"Antoine.gift.roastedhazelnuts.1": "This smelled so good. I almost ate them all before I could bring you some. I tried to make you more, but they didn't last long.$h",

//[612] - Neutral
"Antoine.gift.cranberrycandy.1": "Ha ha, I'm not really sure how I feel about cooking with apples. Watching the Queen of Sauce chopping them up and putting them in a blender... Anyway, it did a good job making a bitter fruit taste really sweet!$h",

//[733] - Loved
"Antoine.gift.shrimpcocktail.1": "Who knew that cocktail sauce was just tomatoes and horseradish? The Queen sure did! I like mine with extra horseradish, but I made yours normally.$h",

//[MossSoup] - Loved
"Antoine.gift.mosssoup.1": "This texture so so interesting, and there is a very earthy flavor to it that brings back fond memories of swamps. Thanks!$h",

//[772] - Loved
"Antoine.gift.oilofgarlic.1": "I've never seen anything like this before. It's so fragrant! I'm sure it's not the best for you, but it smells so good!$h",

//[874] - Loved
"Antoine.gift.bugsteak.1": "This is going to be very interesting to fry up later. Or should I just eat it as is? Hmmm, decisions decisions...$h",

//[403] - Liked
"Antoine.gift.fieldsnack.1": "Oh, I love making these when I'm out in the woods. It's so savory and crunchy.$h",













/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                                            :: */
/* ::  888888 888888 .dP"Y8 888888 88 Yb    dP    db    88       :: */
/* ::  88__   88__   `Ybo."   88   88  Yb  dP    dPYb   88       :: */
/* ::  88""   88""   o.`Y8b   88   88   YbdP    dP__Yb  88  .o   :: */
/* ::  88     888888 8bodP'   88   88    YP    dP""""Yb 88ood8   :: */
/* ::                                                            :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */


/*/  Generic Festival /*/
"Antoine.festival-default": "Hmmm, I wonder if there are any good snacks left?$0",

/*/ Egg Festival /*/
"Antoine.spring13.unmet": "A whole festival all about eggs! I'm so excited! What a fun thing to celebrate!$1",
"Antoine.spring13.friendly": "Maybe next year we can invite all the chickens that brought us the eggs today. I bet they'd love a festival all about them.$h",

/*/ Flower Festival /*/
"Antoine.spring24.unmet": "Aw, thanks for talking to me. You might want to focus on chatting with the person you want to ask to dance though.$h",
"Antoine.spring24.friendly": "You know, for something all about flowers, I really don't see all that many flowers here. Do you think they got their invitations?$0",

/*/ Dance of the Moonlight Jellies /*/
"Antoine.summer28.unmet": "People can be really kind and thoughtful to creatures they don't fully understand. I think that's just wonderful.$h",
"Antoine.summer28.friendly": "The jellies are so happy that everyone comes to see them off, you know? They think the lanterns are really cute too.$h",

/*/ Marketpalooza (from Fellowclown.Nikolai mod) /*/
"Antoine_Marketpalooza.000": "Do you like the snacks? I made them myself! I sort of felt obligated since this happens in my front yard and all.$h",

/*/ Fair /*/
"Antoine.fall16.unmet": "Have you talked to the Fortune Teller? She has such fun stories!$h",
"Antoine.fall16.friendly": "I always feel a bit dizzy just watching everyone run around. There's so much energy here, you know? It's kind of intoxicating.$0",

/*/ Spirit's Eve /*/
"Antoine.fall27.unmet": "I wish people could celebrate monsters all year round. Maybe they'd be nicer to them.$s",
"Antoine.fall27.friendly": "Today everyone gets to dress up as monsters or fairies or princesses. Really anything they want. I'm glad people are so comfortable turning into something else here, even if it's just for one night.$h",

/*/ Feast of the Winter Star /*/
"Antoine.winter25.unmet": "Ugh, it's so coooold. I'm not even sure the food is worth it.$6", 
"Antoine.winter25.friendly": "I know there's more about the feast than just, well, the feast part, but that's all I can ever think about! I guess I'm just not in a giving mood when it's so cold out.$6",



//SPECIFIC DAY DIALOGUE
"Antoine.spring_4": "Did you grow any parsnips this year, @?$l#$b#I bet they're fully grown already!$h",
"Antoine.spring_10": "Coffee beans are actually the pit of a berry, which technically makes them a fruit!$l#$b#I just thought that was neat.$h",

"Antoine.summer_5": "Why do people complain about burning when they eat hot peppers? They don't seem that hot to me.$7#$b#Emily said that birds don't think hot peppers are hot either.$h",
"Antoine.fall_5": "I wonder why Juliet laughs when I talk about how big eggplants are?$7",
"Antoine.fall_10": "Everybody talks about fall reminding them of pumpkins, but I always think about yams!$l#$b#They're just so tasty, and can go in anything, and they're really nice glazed or in a pie.$h",
















/* :::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                              :: */
/* ::  888888  dP"Yb  88  dP 888888 88b 88 .dP"Y8  :: */
/* ::    88   dP   Yb 88odP  88__   88Yb88 `Ybo."  :: */
/* ::    88   Yb   dP 88"Yb  88""   88 Y88 o.`Y8b  :: */
/* ::    88    YbodP  88  Yb 888888 88  Y8 8bodP'  :: */
/* ::                                              :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::: */


























/* :::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                            :: */
/* ::  888888  dP"Yb  88""Yb 88  dP""b8 .dP"Y8   :: */
/* ::    88   dP   Yb 88__dP 88 dP   `" `Ybo."   :: */
/* ::    88   Yb   dP 88"""  88 Yb      o.`Y8b   :: */
/* ::    88    YbodP  88     88  YboodP 8bodP'   :: */
/* ::                                            :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::: */

//intro
"intro.Antoine.spring.1": "Oh! Nice to meet you, I'm Antoine. You have some pretty heavy energies around you. I bet you make a big impact on things in your town.$h",
"intro.Antoine.spring.2": "Hey, it's good to meet you! I hope we can be really good friends.$h",
"intro.Antoine.summer.1": "Hello! It's great to meet you! I'm Antoine. You have some pretty heavy energies around you. I bet you make a big impact on things in your town.$h",
"intro.Antoine.summer.2": "Oh, you've got a real sense of the earth about you. I bet we'll get along great.$h",
"intro.Antoine.fall.1": "Ah, hello there. I'm Antoine. You have the look of someone who shoulders a lot of responsibility. Let me know if there's anything I can do to help you with that.$0",
"intro.Antoine.fall.2": "Nice to meet you, do you have a favorite warm drink? I'd love to make you some if you've got time.",
"intro.Antoine.winter.1": "%The man is smiling, but it looks forced somehow.#b#Hello, I'm Antoine. It's nice to see a new face. I hope you enjoy your stay in town.$0",
"intro.Antoine.winter.2": "Oh, hey there. I'm Antoine. Nice to meet you.$0",

//green rain
"Antoine.GreenRain": "There's something effervescent about the air today. It's so refreshing!$l",
"Antoine.GreenRainFinished": "Sooms the rain has stopped now. Such a shame.$6",

//dating
"Antoine.breakUp": "I see. I respect your decision, though it does upset me. I ... need some time. I think...$6",
"Antoine.RejectBouquet_NotDatable": "Ah, a bouquet is such a sweet gesture. I'm sorry, but I'm not able to accept it. I just don't think I can make that commitment to you right now.$h",
"Antoine.RejectBouquet_NpcAlreadyMarried": "Oh, how sweet of you!$h",
"Antoine.RejectBouquet_VeryLowHearts": "What nice flowers! Who do you plan to give them to?$h",
"Antoine.RejectBouquet_LowHearts": "Oh. Do you need me to brighten those up for you?$7",
"Antoine.RejectBouquet": "Ah, I see. Thank you but ... I don't think I'm ready for that commitment right now.$h",

//marriage
"Antoine.SpouseFarmhouseClutter": "It's so messy in here. Don't you think so?$s",
"Antoine.Spouse_MonstersInHouse": "Watch out! There are monsters in the house!$9",
"Antoine.SpouseStardrop": "I have something for you! I grew it myself!$h",
"Antoine.RejectMermaidPendant_NeedHouseUpgrade": "I'm sorry, but I don't think you have enough space in your house for me.$h",
"Antoine.RejectMermaidPendant_NotDatable": "I'm sorry, but I don't think I can make that commitment to you right now.$h",
"Antoine.RejectMermaidPendant_NpcWithSomeoneElse": "I'm sorry, but I'm already taken.$h",
"Antoine.RejectMermaidPendant_PlayerWithSomeoneElse": "I really don't think your partner would be very happy that you're giving me this.$6",
"Antoine.RejectMermaidPendant_Under8Hearts": "I feel strongly about you, but this is moving a bit quickly, isn't it?$h",
"Antoine.RejectMermaidPendant_Under10Hearts": "A pendant? I love you, but I'm not sure this is the right time.$h",
"Antoine.RejectMermaidPendant_Under10Hearts_AskedAgain": "Ah, again. You're very persistent, and I wish I could say yes, but I just don't feel ready for that sort of step just yet.$h",
"Antoine.RejectMermaidPendant": "I'm sorry, but I don't think I can make that commitment to you right now.$h",

//divorced
"Antoine.divorced": "So this is it then. It was a wonderful adventure we shared, but I understand you feel it's now over. I wish you nothing but happiness, @. Truely.$s",
"Antoine.RejectGift_Divorced": "Normally I am happy to recieve gifts from you, but this feels a bit ... mean spirited.$6",
"Antoine.RejectMermaidPendant_Divorced": "Again? After how it ended last time? No I ... don't think I can repeat that.$6",
"Antoine.RejectBouquet_Divorced": "You know, you had all of me before and decided things were not working between us. Let's not repeat out mistakes, hmm?$6",
"Antoine.WipedMemory": "I ... feel like I've forgotten something very important... Ah well, what do you need, @?$h",

//island
"Antoine.Resort": "The sun here really is quite delicious.$h",
"Antoine.Resort_Bar": "The drinks here seem quite ... strong. I'd best avoid them, I think.$h",
"Antoine.Resort_Chair": "I see you're enjoying the view. It's so peaceful here.$h",
"Antoine.Resort_Dance": "Ah, do you wish to dance with me? The music is invigorating.$h",
"Antoine.Resort_Entering": "I see you're enjoying the music. It's so ... lively.$h",
"Antoine.Resort_Leaving": "Well I must be off. It's been a pleasure.$h",
"Antoine.Resort_Shore": "I see you're enjoying the shore. It's so peaceful here.$h",
"Antoine.Resort_Towel": "This towel seems to be, ah, well used.$s",
"Antoine.Resort_Umbrella": "I adore the sun, but even I need a break from it every once in a while.$h",
"Antoine.Resort_Wander": "I think I'll wander and see where my feet take me.$h",

//birthday
"Antoine.AcceptBirthdayGift_Negative": "Is this for me? I don't think I'll like it but I'll try and make some use of it...$s",
"Antoine.AcceptBirthdayGift_Positive": "Ah! How wonderful! Thank you!$h",
"Antoine.AcceptBirthdayGift": "A gift for me? How thoughtful of you.$h",

//dating proposal
"Antoine.AcceptBouquet": "Really? For me? I'd love to accept it!$h",

//trashcan
"Antoine.DumpsterDiveComment": "I see you think people have the most interesting trash too.$h",

//slingshot
"Antoine.HitBySlingshot": "Ah, I see you're a bit of a marksman. I bet you could hit a target from a mile away.$h",




"Antoine.cc_Minecart":  "It should be much easier to travel through town now. Though the ride is a bit scary.$h",
"Antoine.cc_Bus": "Coconuts are so versatile! They're tasty, they go well in desserts and drinks, and their oil is so good for your skin too.$h",
"Antoine.cc_Boulder": "Ah, the water was straining quite a lot. It must be a relief to flow freely once again.$h",
"Antoine.cc_Greenhouse": "A greenhouse is a wonderful thing. I'm happy you managed to obtain one.$h",
"Antoine.movieTheater": "We have a movie theater. It's nice to see that space being repurposed.$h",
"Antoine.cc_Complete":  "It doesn't surprise me that you gravitated towards the community here. I wonder if magic had not been at your back if you would have done as well?$0#$b#Regardless, I'm very happy that everyone is coming together.$h",
"Antoine.joja_Begin": "Be careful with your choices. You are dynamic, and your actions affect more than just yourself.$s",
"Antoine.pamHouseUpgrade": "It was so nice of you to give Pam and Penny a better home! Maybe if Pam is surrounded by wood instead of metal she can start to feel better.$h",
"Antoine.pamHouseUpgradeAnonymous": "Did you hear that someone built Pam and Penny a house? Maybe if Pam is surrounded by wood instead of metal she can start to feel better.$h",

/*/

Note: This is some generic movie dialog just in case someone has a movie mod installed. It is commented out so that it does not break anything.

"Antoine.movies.#.before": "I'm really excited. I don't really like going to the movies by myself, and everyone in town seems to already have a favorite person that they'd rather watch one with.$0#$b#It really means a lot that you think about me as a favorite person that you want to see a movie with.$h", 
"Antoine.movies.#.during": "null", //Antoine has no reaction during the movie | "Response": "like",
"Antoine.movies.#.after": "The snack you got me was really delicious! Huh? What did I think of the movie? Um, I got a little lost so I'm not actually sure I understood what it was about.$0#$b#I hope you're not disappointed. I'd love to go to the movies with you again.$h",

/*/
"RejectMovieTicket_AlreadyInvitedBySomeoneElse": "Oh, I'm terribly sorry, but I'm too busy to see that one with you. Someone else has already asked.",
"RejectMovieTicket_AlreadyWatchedThisWeek": "Oh, you wish to see it again? Sounds fun!",
"RejectMovieTicket_Divorced": "I'm surprised you want to watch that with me... I'm not sure I'd be able to handle it.",
"RejectMovieTicket_DontWantToSeeThatMovie": "I'm sorry, but I don't want to see that movie.",
"RejectMovieTicket": "I'm sorry, but I'm not really in a movie mood.",

/*/ Invites /*/
"MovieInvite.Antoine.spring.1": "You want me to watch a movie with you? Oh, I'd love to, @!$h",
"MovieInvite.Antoine.spring.2": "This is turning out to be a pretty great day. A movie sounds really fun!$h",

"MovieInvite.Antoine.summer.1": "Ha ha, you're in luck, I just managed to wrap up what I was doing. A movie sounds great.$h",
"MovieInvite.Antoine.summer.2": "A movie with you? I think I have time for that. Sure!$h",

"MovieInvite.Antoine.fall.1": "Oh, a movie sounds good, but, uh, do you think it'll be scary?$h",
"MovieInvite.Antoine.fall.2": "A movie? Sure. Hmm, I wonder what kind of snacks they'll have in stock.$0",

"MovieInvite.Antoine.winter.1": "Oh, thanks for the invitation, @. I'm, um, I'm excited.%0",
"MovieInvite.Antoine.winter.2": "Uh, you want me to go to a movie? I mean, thanks. The theater's heater is working, right?$s",

/*/ Brave Little Sapling /*/
"Antoine.movies.0.before": "%Antoine is visibly excited.", 
"Antoine.movies.0.during": "%Antoine is leaning forward, absolutely enthralled.",//"Response": "love",
"Antoine.movies.0.after": "The message in this movie is so important, don't you think? The balance between sadness and happiness is crucial to a good life.$h#$b#Too much rain would drown the earth, but too much sun can also burn and make things dry and hollow. It's comforting to be reminded of things like that.$0",


/*/ Natural Wonders /*/
"Antoine.movies.1.before": "This movie should be very educational, I'm looking forward to it.$h", 
"Antoine.movies.1.during": "%Antoine is paying very close attention.",//"Response": "love",
"Antoine.movies.1.after": "I really liked that. I learned a lot and the animals were absolutely adorable!",


/*/ The Prairie King /*/
"Antoine.movies.2.before": "I hear the Prairie King is very exciting. Thank you for inviting me to see it with you.$h",
//"ResponsePoint": "PK_villain",
//"Script": "/message \"Antoine is on the edge of his seat.\"",
"Antoine.movies.2.during": "No, sheriff! Look out!$9",//"Response": "like",
"Antoine.movies.2.after": "That was exciting! I'm really glad that the sheriff managed to keep that wagon train safe, but I think I need to go home and take a nap now.$h",


/*/ Wumbus /*/
"Antoine.movies.3.before": "I'm really looking forward to this one!$h",
"Antoine.movies.3.during": "%Antione looks absolutely delighted and is laughing quite hard at all of the funny moments.",//"Response": "love",
//"Script": "/message \"Antoine is laughing.\"",
"Antoine.movies.3.after": "I think I need a FoodBot too!$h",


/*/ Mysterium /*/
"Antoine.movies.4.before": "Oh, I've heard really interesting things about this one.",
"Antoine.movies.4.during": "%Antoine has a puzzled look on his face, but is also totally enraptured.",//"Response": "love",
"Antoine.movies.4.after": "That was so interesting! The existential nihilism was perfectly encapsulated by the thirty minute bone dance.$h",


/*/ It Howls In The Rain /*/
"Antoine.movies.5.before": "I, um, thanks for inviting me. I'll admit I'm a little nervous about this one.",
"Antoine.movies.5.during": "%Antione is tightly gripping his shirt.",//"Response": "like",
"Antoine.movies.5.after": "D-do you think you could walk me home?$9#$b#Ha, ha. Never mind. I can make it on my own, I think.$0",


/*/ Miracle At Coldstar Ranch /*/
"Antoine.movies.6.before": "Um, you want to go see a movie with me? Right now? I mean, I guess I will, since you're the one that's asking @.$s",
//"Script": "/message \"Antoine took his coat off and is using it like a blanket.\"",
"Antoine.movies.6.during": "Hmm? No, I'm having a good time. The theater is nice and warm.$0",//"Response": "neutral",
"Antoine.movies.6.after": "Hey, @, do you really buy into this Winter Star stuff?$s#$b#I mean, it's a nice story and all, but it feels a little ... hollow, I guess? I love magic, but relying on it to not starve? ...$6#$b#Sorry, I know you brought me to have a good time. I hope I didn't bring the mood down too much.$0",


/*/ Zuzu City Express /*/
"Antoine.movies.7.before": "Oh, isn't this a romantic movie? I find those a little ... frustrating.$s",
"Antoine.movies.7.during": "This is so unfair. She can't possibly make an informed choice right now.$a",//"Response": "neutral",
"Antoine.movies.7.after": "How disappointing. The movie could have at least had the courtesy of giving us a proper ending after so much drama.$s#$b#Oh, uh, sorry I didn't hate the movie or anything. The choice just seemed so obvious from the start and it was sort of tiring to watch her keep going back to him.$0",


"Resort_Entering.Antoine.spring.1": "You know, coconuts are really useful. It's great for your skin and hair, and when you're done with the flesh, you can make a fun hat out of it too!$h",
"Resort_Entering.Antoine.spring.2": "",

"Resort_Entering.Antoine.summer.1": "I here there are pirates somewhere on this island. You stay safe, okay?$s",
"Resort_Entering.Antoine.summer.2": "",

"Resort_Entering.Antoine.fall.1": "Mmm, I can already feel my bones warming up. Don't tell that professor though, he seems sort of obsessed with bones.$h",
"Resort_Entering.Antoine.fall.2": "",

"Resort_Entering.Antoine.winter.1": "Aaaah, it's so warm here. If I could I'd probably just live here until winter is over.$h",
"Resort_Entering.Antoine.winter.2": "",

"Resort_Leaving.Antoine.spring.1": "Ha ha, I sort of feel like I just got here, but I'm looking forward to getting home too.$h",
"Resort_Leaving.Antoine.spring.2": "",

"Resort_Leaving.Antoine.summer.1": "It sort of feels like it's summer here all year round, doesn't it? Maybe I should think of coming here more often when it's cold...$0",
"Resort_Leaving.Antoine.summer.2": "",

"Resort_Leaving.Antoine.fall.1": "I asked Gus if he could mix some drinks with more spice in them, but I think he thought I meant adding a lot of hot peppers. It was still tasty though.$0",
"Resort_Leaving.Antoine.fall.2": "",

"Resort_Leaving.Antoine.winter.1": "I really don't want to go back, but I have to. I still have responsibilities to attend to, after all.$s",
"Resort_Leaving.Antoine.winter.2": "",

"Resort_Shore.Antoine.spring.1": "There are a lot of parrots here, but that's not really surprising. They're very social birds. Sometimes a flock can have thousands of them in it.$h",
"Resort_Shore.Antoine.spring.2": "You know what's neat? Ocean plants give make most of the world's oxygen. They're sturdy little guys.$h",

"Resort_Shore.Antoine.summer.1": "Ginger always reminds me of tiger slimes. They smell good too.$h",
"Resort_Shore.Antoine.summer.2": "",

"Resort_Shore.Antoine.fall.1": "Some jellyfish are immortal. Just another one of their vast mysteries. Don't you think?$7",
"Resort_Shore.Antoine.fall.2": "",

"Resort_Shore.Antoine.winter.1": "The air feels really fresh by the sand, doesn't it?",
"Resort_Shore.Antoine.winter.2": "",

"Resort_Umbrella.Antoine.spring.1": "Did you know that tap-root vegetables really thrive in sand? Sandy soil is roomy and water sifts through it quickly so they can drink a lot and get pretty big without all that clay in the way.$h",
"Resort_Umbrella.Antoine.spring.2": "",

"Resort_Umbrella.Antoine.summer.1": "I heard that the pineapple is called that because it looks like a child's head with a thousand eyes.$h",
"Resort_Umbrella.Antoine.summer.2": "",

"Resort_Umbrella.Antoine.fall.1": "I finally managed to bribe a monkey into getting me some magma caps. I can't wait to put some in a salad.$h",
"Resort_Umbrella.Antoine.fall.2": "",

"Resort_Umbrella.Antoine.winter.1": "Have you ever thought about, just, drinking lava?$7",
"Resort_Umbrella.Antoine.winter.2": "",

"Resort_Wander.Antoine.spring.1": "Have you seen the monkey's floating in lava in the volcano? Apparently they have really high standards for being petted.$8",
"Resort_Wander.Antoine.spring.2": "",

"Resort_Wander.Antoine.summer.1": "I'm going to gather so much ginger while I'm here. The spice of it is just perfect for adding warmth to a dish.$0",
"Resort_Wander.Antoine.summer.2": "",

"Resort_Wander.Antoine.fall.1": "Maybe I should ask the parrots where the best place to find walnuts is?$7",
"Resort_Wander.Antoine.fall.2": "",

"Resort_Wander.Antoine.winter.1": "Dr. Harvey says I should drink more ginger tea when I'm not feeling my best. Apparently ginger can help with serotonin.$0",
"Resort_Wander.Antoine.winter.2": "",

"Resort_Bar.Antoine.spring.1": "",
"Resort_Bar.Antoine.spring.2": "",

"Resort_Bar.Antoine.summer.1": "",
"Resort_Bar.Antoine.summer.2": "",

"Resort_Bar.Antoine.fall.1": "",
"Resort_Bar.Antoine.fall.2": "",

"Resort_Bar.Antoine.winter.1": "",
"Resort_Bar.Antoine.winter.2": "",

"Resort.Antoine.spring.1": "The biome here is so interesting. I've been finding all sorts of epiphylls.$h#b#Epiphylls? They're tiny non-vascular plants that grow on leaves, like moss or algae. They don't have any roots, you see, they absorb water and nutrients from the air. Isn't that neat?$l",
"Resort.Antoine.spring.2": "",

"Resort.Antoine.summer.1": "",
"Resort.Antoine.summer.2": "",

"Resort.Antoine.fall.1": "",
"Resort.Antoine.fall.2": "",

"Resort.Antoine.winter.1": "",
"Resort.Antoine.winter.2": "",











/* :::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::: */
/* ::                                      :: */
/* ::  8888b.     db    88 88     Yb  dP   :: */
/* ::   8I  Yb   dPYb   88 88      YbdP    :: */
/* ::   8I  dY  dP__Yb  88 88  .o   8P     :: */
/* ::  8888Y"  dP""""Yb 88 88ood8  dP      :: */
/* ::                                      :: */
/* :::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::: */


/*/ 0-Hearts ~ Spring /*/
"Antoine.Spring.1": "I love the spring, the flowers really start singing.$h",
"Antoine.Spring.2": "I woke up this morning and my porch was covered in pollen!$h#$b#I gathered it up with some wind magic and blew it towards some flowers, I hope it was helpful for them.$0",
"Antoine.Spring.3": "Do you find yourself really busy this time of year? I just can't seem to get everything done before summer brings in new flowers.$0",
"Antoine.Spring.4": "Aideen really respects her flowers and they can tell! That's why they want to look extra pretty for her.$h",
"Antoine.Spring.5": "Are you ready for summer yet, @? I never really feel like I am.$0",
"Antoine.Spring.6": "I was sort of surprised to see how small bees are in the valley. At home they're big bumbly guys.$h",
"Antoine.Spring.7": "Hey, @. Out for a nice walk? Me too!$h",
"Antoine.Spring.8": "Do you find yourself really busy this time of year? I just can't seem to get everything done before summer brings in new flowers.$0",
"Antoine.Spring.9": "You know, I've been here for a while now and I still haven't gotten used to how dry the air is.$0",
"Antoine.Spring.10": "This morning I made myself a nature's breakfast.$0$h#$b#It's mostly just berries.$1",
"Antoine.Spring.11": "Have I told you that I really appreciate that you take so much time out of your day to chat with me? Well now I am!$h",
"Antoine.Spring.12": "Are you ready for summer yet, @? I never really feel like I am.$0",
"Antoine.Spring.13": "Have you ever looked at a sweet gem berry and just wanted to bite into it?$7#$b# Don't. It's a mistake.$2",
"Antoine.Spring.end.1": "Spring is almost over. I'm going to miss watching petals dance in the soft breeze.$0",


/*/ 0-Hearts ~ Summer /*/
"Antoine.Summer.1": "Phew! It's getting pretty hot, huh? I really hope it rains again soon!$h",
"Antoine.Summer.2": "Everyone in town really seems to like summer time, don't they?$h",
"Antoine.Summer.3": "Back home it'd get so humid you could go outside and practically drown standing up.$h",
"Antoine.Summer.4": "Back home sunflower's look like big, yellow, puff balls. I was pretty surprised when they had such cute faces here!$h",
"Antoine.Summer.5": "I heard on the wind that %favorite was your favorite thing in the world. I think that's really interesting.$h",
"Antoine.Summer.6": "The mountain goats seem really lively in all this heat. I wonder why they like it so much? Maybe it reminds them of home?$0",
"Antoine.Summer.7": "The other day I used a spell to chill my drink because I ran out of ice. A silly use of magic, I know, but man the drink was tasty.$h",
"Antoine.Summer.8": "Eloise helped me name some flowers today, she had some really fun suggestions. My favorite was Mr. Wigglepetals.$h",
"Antoine.Summer.9": "Do you like going out in the rain too? I see you out in it a lot.$1",
"Antoine.Summer.10": "It's really strange how some of the fruits that I enjoyed growing at home don't seem to like it here.$7#$b#I guess they just prefer a more humid climate.$0",
"Antoine.Summer.11": "The mountain goats seem really lively in all this heat. I wonder why they like it so much? Maybe it reminds them of home?$0",
"Antoine.Summer.12": "The other day I used a spell to chill my drink because I ran out of ice. A silly use of magic, I know, but man the drink was tasty.$h",
"Antoine.Summer.13": "Hmmm. Jaz asked me to help her name one of the new chickens. What do you think of %name?$0",
"Antoine.summer.end.1": "Fall is just around the corner. I've been saying my farewells to the leaves on the trees before the wind takes them on their final journey.$0",

/*/ 0-Hearts ~ Fall /*/
"Antoine.Fall.1": "%Antoine has a small plant in his hand and is using magic to keep the roots wet.#b#Oh, don't mind me, @. I'm just going to take this little guy somewhere warmer.$s",
"Antoine.Fall.2": "Rosa really works hard to help everyone else out. I'm glad I'm able to help her sometimes too.$0",
"Antoine.Fall.3": "Spring hasn't been gone that long, but I already kind of miss it.$0",
"Antoine.Fall.4": "Yesterday Gus asked me to help mix spiced drinks, but I think he thought he meant adding a lot of hot peppers. It was still tasty though.$0",
"Antoine.Fall.5": "It's getting colder. I wish it could stay warm, but the colors are very nice, aren't they?$h",
"Antoine.Fall.6": "I really love just wandering around and tasting all of the treats the bushes and trees prepare for everyone.$0",
"Antoine.Fall.7": "I'm going to have to break out my scarf soon. It's very cozy, but sometimes wearing it for too long makes me itchy.$0",
"Antoine.Fall.8": "It's getting colder. I wish it could stay warm, but the colors are very nice, aren't they?$h",
"Antoine.Fall.9": "Winter is coming. Forgive me if I'm a little melancholy, @. I always get this way before the snow falls.$0",
"Antoine.Fall.10": "I'm going to have to break out my scarf soon. It's very cozy, but sometimes wearing it for too long makes me itchy.$0",
"Antoine.Fall.11": "Ugh, it's getting colder again. I love all the fruit and forage you can find in the fall, but I really wish it'd just stay warm.$0",
"Antoine.Fall.13": "I spent the week gathering hazelnuts to give to Linus, and he really enjoyed them. We roasted them over his fire together.%revealtasteLinus408$h",
"Antoine.Fall.end.1": "Winter is coming. Forgive me if I'm a little melancholy, @. I always get this way before the snow falls.$0",

/*/ 0-Hearts ~ Winter /*/
"Antoine.Winter.1": "I've roasted all of the hazelnuts I gathered in the fall. I was going to bring some to you, but I ended up just eating them all. Sorry.$0",
"Antoine.Winter.2": "Gus says that coffee stays warmer if you add cream to it. I wonder if that applies to hot chocolate too?$0",
"Antoine.Winter.3": "Nothing grows in winter but fiber and forage.$2#$b#Snow yams are pretty nice though.$0",
"Antoine.Winter.4": "I wish I could stay home when it's cold like this, but there are flowers that love the snow and it's not fair if I just ignore them because I'm uncomfortable.$2",
"Antoine.Winter.5": "Cold weather doesn't seem to agree with me. I know it can't just stay warm forever, even the flowers need to rest sometimes.$s",
"Antoine.Winter.6": "I've collected a bunch of snow yams to roast in my fireplace. They're a little bitter, but much softer and a bit warmer than regular yams.$0",
"Antoine.Winter.7": "The snow is very pretty, and I love that there is water everywhere, even if it's frozen. I just wish it didn't bite me when I touched it.$0",
"Antoine.Winter.8": "It's so cold! Huh? Why don't I just use magic to warm myself up? I really try not to use too much magic just on myself. People can get really twisted up that way.$s",
"Antoine.Winter.9": "Do you think everyone would be upset if I brought home a pepper rex? This time of year that fire breath would be really nice to have around.$0",

/*/ 2-Hearts ~ Spring /*/
"Antoine.Spring.2h.1": "I was thinking this morning about how a honey bee worker only makes an average of 1/12 of a teaspoon in her lifetime.$7#$b#That doesn't sound like much to us, but for something so small that lives for such a short time, it really is a big contribution.$h",
"Antoine.Spring.2h.2": "So apparently everyone in East Scarpe complains about the crabs that show up there at night, but I don't really understand why. I've never had one pinch me once.$7",
"Antoine.Spring.2h.3": "The wizard says that space tastes like salmonberries. Now I just want to make a tart out of the galaxy.$u",
"Antoine.Spring.2h.4": "Aideen really respects her flowers and they can tell! That's why they want to look extra pretty for her.$h",
"Antoine.Spring.2h.5": "You have a pet, right @? I've thought about getting one, but they seem like a lot of trouble. I bet you feel like %pet is pretty worth it though, huh?$h",
"Antoine.Spring.2h.6": "Coffee beans are actually the pit of a berry, which technically makes them a fruit!$l#$b#I just thought that was neat.$h",
"Antoine.Spring.2h.7": "I'm going to miss watching petals dance in the soft breeze when spring is over.$0",
"Antoine.Spring.2h.8": "I accidentally startled Haley earlier by watering a flower while she was trying to take a picture of some birds. She had some ... opinions about it.$s",

/*/ 2-Hearts ~ Summer /*/
"Antoine.Summer.2h.1": "Everyone in town really seems to like summer time, don't they?$h",
"Antoine.Summer.2h.2": "It's really strange how some of the fruits that I enjoyed growing at home don't seem to like it here.$7#$b#I guess they just prefer a more humid climate.$0",
"Antoine.Summer.2h.3": "On a super hot day, the rain is really welcome. Don't you think?$0#$b#The flowers thinks so too.$h",
"Antoine.Summer.2h.4": "Back home sunflower's look like big, yellow, puff balls. I was pretty surprised when they had such cute faces here!$h",
"Antoine.Summer.2h.5": "I heard on the wind that %favorite was your favorite thing in the world. I think that's really interesting.$h",
"Antoine.Summer.2h.6": "Hey, @. What do you think color of a mirror is? I asked the wizard, but the answer took a couple of hours. I sort of zoned out half way through.$7",
"Antoine.Summer.2h.7": "Sometimes I sneak some magic into the feed Marnie gives to her chickens to give their feathers some more luster.$u#$b#Please don't tell Jaz though, she thinks they're looking better because she's been reading them bed time stories and it's making them happier.$h",

/*/ 2-Hearts ~ Fall /*/
"Antoine.Fall.2h.1": "Fall leaves have all those colors inside of them all year round, but we only get to see it when they are about to let out their last breath.$h",
"Antoine.Fall.2h.2": "Hey, @, before you make a phone call, do you ever rehearse what you are going to say?$7#$b# I find it kind of helpful.$h",
"Antoine.Fall.2h.3": "Everybody talks about fall reminding them of pumpkins, but I always think about yams!$l#$b#They're just so tasty, and can go in anything, and they're really nice glazed or in a pie.$h",
"Antoine.Fall.2h.4": "Linus and I had a big yam bake last night!$h#$b#I couldn't really get him to come to my place to use the oven, but cooking everything over an open fire was just as nice.$0",
"Antoine.Fall.2h.5": "Spring hasn't been gone that long, but I already kind of miss it.$s",
"Antoine.Fall.2h.6": "I've always had mixed feelings about this time of year. Everything needs to change in order to grow, but also I miss what we lose in the process.$0",
"Antoine.Fall.2h.7": "Everyone seems to stay inside when it's raining, but I want to enjoy it before it turns to ice.$0",

/*/ 2-Hearts ~ Winter /*/
"Antoine.Winter.2h.1": "Mmmm, I should have made more hot chocolate to drink. I finished my last mug of it earlier and I miss it already.$s",
"Antoine.Winter.2h.2": "It's so cold! Too cold! I can't wait for it to be warm again!$a",
"Antoine.Winter.2h.3": "Have you ever just cooked up a bunch of yams, crushed them up into a big bowl with honey, and just dug into it with your hands? It's so warm.$0",
"Antoine.Winter.2h.4": "I had a sort of lazy morning. It's hard to feel like getting things done sometimes.$6",
"Antoine.Winter.2h.5": "%Antoine smiles at you, but doesn't really feel like talking today.",
"Antoine.Winter.2h.6": "Oh, hello, @. Forgive me if I'm a little low energy today. It was a slow morning.",
"Antoine.Winter.2h.7": "Hey, @, do you ever wonder if ... $s#b#No, never mind. Have a great day today.$h",

/*/ 4-Hearts ~ Spring /*/
"Antoine.Spring.4h.1": "You know, they didn't used to always call it spring. They had another word for it, but it was changed to springing because plants were springing forth from the ground.$l#$b#The name changed to spring-time about 100 years later and was eventually shortened to just spring.$l",
"Antoine.Spring.4h.2": "Have I told you that I really appreciate that you take so much time out of your day to chat with me? Well now I am!$h",
"Antoine.Spring.4h.3": "If I had a magic box that could bring back any inanimate object that I've lost in my entire life, I think I'd use it to bring back the ribbon that I lost when I tied up my new hair for the very first time.$0",
"Antoine.Spring.4h.4": "You know, Pierre and Morris seem to really hate each other even though they have a lot in common. If they just sat down and talked they could probably be good friends.$7",
"Antoine.Spring.4h.5": "I was sort of surprised to see how small bees are in the valley. At home they're big bumbly guys.$h",
"Antoine.Spring.4h.6": "Have you ever just cooked up a bunch of yams, crushed them up into a big bowl with honey, and just dug into it with your hands? It's so warm.$0",
"Antoine.Spring.4h.7": "I woke up this morning and my porch was covered in pollen!$h#$b#I gathered it up with some wind magic and blew it towards some flowers, I hope it was helpful for them.$0",
"Antoine.Spring.4h.8": "So apparently everyone in East Scarpe complains about the crabs that show up there at night, but I don't really understand why. I've never had one pinch me once.$7",
"Antoine.Spring.4h.9": "Has anyone told you that you smell like the earth? Not just the soil, but the spirit too.$h",
"Antoine.Spring.4h.10": "You know, they didn't used to always call it spring. They had another word for it, but it was changed to springing because plants were springing forth from the ground.$l#$b#The name changed to spring-time about 100 years later and was eventually shortened to just spring.$l",
"Antoine.Spring.4h.11": "You know, if I had to replace my left hand with a kitchen tool I think it would be a chef's knife.#b#Though, a serrated knife would be good too...$7",
"Antoine.Spring.4h.12": "Did you grow any parsnips this year, @?$l#$b#I bet they were huge!$h",

/*/ 4-Hearts ~ Summer /*/
"Antoine.Summer.4h.1": "It got so hot last night I actually took a nap inside my fridge. Hmm? Yes, I know it's too small to fit a body.$h",
"Antoine.Summer.4h.2": "Phew! It's getting pretty hot, huh? I really hope it rains again soon!$h",
"Antoine.Summer.4h.3": "They're really hard to find, but purple mushrooms have such a unique flavor.$7#b#I tried to make some fried mushrooms from them for the wizard and, well, it was definitely received.$u",
"Antoine.Summer.4h.4": "I had to move some Sweet Peas today to another location. The other plants were bullying them out of root space because they were strangers there. They're having a much nicer time with their siblings.$0",
"Antoine.Summer.4h.5": "Have you been cutting a lot of grass lately? Be careful, @. If you cut the wrong plant it'll scream out for birds or some other predator to come and protect it.$s",
"Antoine.Summer.4h.6": "Back home it'd get so humid you could go outside and practically drown standing up.$h",
"Antoine.Summer.4h.7": "You know, plants can see, smell, hear, taste, and touch just like a person can. Plus ten to fifteen other things.$u",
"Antoine.Summer.4h.8": "Have you ever seen Mr. Frog eat food? They pull their eyes down into the roof of their mouth and use them to push it down their throat. It's really interesting to watch.$h",
"Antoine.Summer.4h.9": "Have you ever gone so high in a swing that you threw yourself out? It's pretty fun.$h#b#Though, uh, maybe make sure you have a good snack or elixir on hand before you do it.$0",
"Antoine.Summer.4h.10": "Ginger always reminds me of tiger slimes. They smell good too!$h",
"Antoine.Summer.4h.11": "Hmmm. Jaz asked me to help her name one of the new chickens. What do you think of %name?$0",

/*/ 4-Hearts ~ Fall /*/
"Antoine.Fall.4h.1": "A friend was telling me about cave carrot brulee and my mouth started watering. Now I just HAVE to taste it.$h#$b#Oh, or maybe I'll try cave carrot au gratin instead?$7",
"Antoine.Fall.4h.2": "I heard on the wind that %favorite was your favorite thing in the world. I think that's really interesting.$h",
"Antoine.Fall.4h.3": "Fall leaves are brighter when there's been a lot of warm days followed by cold evenings. Just so long as it doesn't get too cold.#b#Ha ha, I feel the same way.$h",
"Antoine.Fall.4h.4": "They're really hard to find, but purple mushrooms have such a unique flavor.$7#b#I tried to make some fried mushrooms from them for the wizard and, well, it was definitely received.$u",
"Antoine.Fall.4h.5": "%Antoine looks a little uncomfortable.#b#Oh, hey, @. It's a little extra chilly today, isn't it? I hope that doesn't mean winter is coming early.",
"Antoine.Fall.4h.6": "A friend was telling me about cave carrot brulee and my mouth started watering. Now I just HAVE to taste it.$h#$b#Oh, or maybe I'll try cave carrot au gratin instead?$7",
"Antoine.Fall.4h.7": "%Antoine is humming a song to himself and seems oblivious to everything else.",
"Antoine.Fall.4h.8": "Linus and I had a big yam bake last night!$h#$b#I couldn't really get him to come to my place to use the oven, but cooking everything over an open fire was just as nice.$0",
"Antoine.Fall.4h.9": "I really love just wandering around and tasting all of the treats the bushes and trees prepare for everyone.$h",
"Antoine.Fall.4h.10": "Do you know what to cook with cactus fruit? Emily brought some back with her when she went to visit her friend in the Calico Desert, and was very kind to give me some.$h",
"Antoine.Fall.4h.11": "I think I like tending to the flowers in the cemetary the best. The spirits don't have a way to tend to them for themselves, but they always enjoy their resting place looking nice.$h",
"Antoine.Fall.4h.12": "You have a pet, right @? I've thought about getting one, but they seem like a lot of trouble. I bet you feel like %pet is pretty worth it though, huh?$h",
"Antoine.Fall.4h.13": "I caught a fat catfish in the river earlier. I should really get some milk to soak it in.",
"Antoine.Fall.4h.14": "Fall leaves are brighter when there's been a lot of warm days followed by cold evenings. Just so long as it doesn't get too cold.#b#Ha ha, I feel the same way.$h",

/*/ 4-Hearts ~ Winter /*/
"Antoine.Winter.4h.1": "I wish I could stay home when it's cold like this, but there are flowers that love the snow and it's not fair if I just ignore them because I'm uncomfortable.$2",
"Antoine.Winter.4h.2": "It's so cold! Huh? Why don't I just use magic to warm myself up? I really try not to use too much magic just on myself. People can get really twisted up that way.$2",
"Antoine.Winter.4h.3": "I don't feel up to doing all of my rounds today. I hope nobody hates me for not saying hi to them.$s",
"Antoine.Winter.4h.4": "I was telling Eloise and Jas that holly is actually a stone fruit, but then Vincent wanted to some. Luckily Penny managed to stop him in time.$0",
"Antoine.Winter.4h.5": "Sometimes I wonder if eternity actually exists. One day the spheres may stop singing and everything would turn to nothingness. Though, I guess if it turns into nothing, it's technically still turning into something. Hmmm.$7",
"Antoine.Winter.4h.6": "You know, the sun looks bigger during the winter. Demetrius says it's because the sun is closer to us, but it sure doesn't make things any warmer.$2",
"Antoine.Winter.4h.7": "You're happy with the choice you made to leave one life and build another, right @? It must have been hard for you.$s#b#You must miss your old life sometimes, even if it's silly to.$0",
"Antoine.Winter.4h.8": "I'm really tired today. Maybe I'll sleep in tomorrow...",
"Antoine.Winter.4h.9": "Ha ha, I always get so lazy in the winter time. I just want to stay home all day and veg in front of my laptop.$0",
"Antoine.Winter.4h.12": "I had a sort of lazy morning. It's hard to feel like getting things done sometimes.$6",
"Antoine.Winter.4h.13": "The sauce in frozen pizza is always so sweet. Is it too much to ask that my tomato sauce doesn't taste like candy?$6",
"Antoine.Winter.4h.14": "Mmmm, I should have made more hot chocolate to drink. I finished my last mug of it earlier and I miss it already.$s",

/*/ 6-Hearts ~ Spring /*/
"Antoine.Spring.6h.1": "I don't know about Joja-Mart. Rosa got some lemon juice from there, but it said it had artificial flavors. Which I find really strange, because she got dish soap from there too and it had real lemons in it.$7",
"Antoine.Spring.6h.2": "It's a really nice day today! It's even nicer because I got to say hi to you.$h",
"Antoine.Spring.6h.3": "%Antoine seems to be concentrating pretty hard about something. Probably best not to bother him.",
"Antoine.Spring.6h.4": "I was thinking this morning about how a honey bee worker only makes an average of 1/12 of a teaspoon in her lifetime.$7#$b#That doesn't sound like much to us, but for something so small that lives for such a short time, it really is a big contribution.$h",
"Antoine.Spring.6h.5": "I remember when people used potatoes to cure colds. They'd put slices of them raw into their socks. Ha ha, it didn't really work that well, but I liked to help them get over the cold anyway because it was such a fun idea.$h",
"Antoine.Spring.6h.6": "Has anyone told you that you smell like the earth? Not just the soil, but the spirit too.$h",
"Antoine.Spring.6h.7": "You know, what you make your oil out of really matters. Oil from corn is pretty useful, but if you use it to make mayonnaise it'll be pretty sour.$h#b#When you use sunflowers the oil isn't great for cooking, but is really tasty in dressings. Neat, huh?$h",
"Antoine.Spring.6h.8": "Hey, @, before you make a phone call, do you ever rehearse what you are going to say?$7#$b# I find it kind of helpful.$h",
"Antoine.Spring.6h.9": "People have been cooking for over a million years. It's always been something I wanted to get really good at. I think I'm doing a pretty good job.$h",
"Antoine.Spring.6h.10": "I asked Maru once what radioactive vegetables would taste like, and she said that it wouldn't taste like anything, and in fact, we'd never know if it was irradiated at all. How spooky.$7",
"Antoine.Spring.6h.11": "Oh! @! I read something really interesting! If you want your drink to cool down faster don't stir it. Stirring adds kinetic energy and that makes things hotter!$l",
"Antoine.Spring.6h.12": "Hey, @. What do you think color of a mirror is? I asked the wizard, but the answer took a couple of hours. I sort of zoned out half way through.$7",
"Antoine.Spring.6h.13": "Did you know the first ever recorded recipe was for beer? Beer was really important to people back then. Unfermented grain tastes pretty awful, so fermenting it provided people with a much needed source of protein. It even got used as currency for a while.$h",
"Antoine.Spring.6h.14": "Sometimes I sneak some magic into the feed Marnie gives to her chickens to give their feathers some more luster.$u#$b#Please don't tell Jaz though, she thinks they're looking better because she's been reading them bed time stories and it's making them happier.$h",

/*/ 6-Hearts ~ Summer /*/
"Antoine.Summer.6h.1": "Do you know what my favorite thing about cooking is? It's as much magic as it is science.$h",
"Antoine.Summer.6h.2": "If I had a magic box that could bring back any inanimate object that I've lost in my entire life, I think I'd use it to bring back the ribbon that I lost when I tied up my new hair for the very first time.$0",
"Antoine.Summer.6h.3": "The mind is so fascinating. I read online that round white plates makes people think food is sweeter, and black square plates make people think it's more savory. Isn't that cool?$l",
"Antoine.Summer.6h.4": "Sometimes I wonder if eternity actually exists. One day the spheres may stop singing and everything would turn to nothingness. Though, I guess if it turns into nothing, it's technically still turning into something. Hmmm.$7",
"Antoine.Summer.6h.5": "I learn so many neat things online, but sometimes I lose track of time doing it.$h",
"Antoine.Summer.6h.6": "I heard that the pineapple is called that because it looks like a child's head with a thousand eyes.$h",
"Antoine.Summer.6h.7": "If you're getting to hot you can stand under a tree. The shade is going to be 20 cooler. Plus the tree lowers air temperature by evaporating water on it's leaves.$0",
"Antoine.Summer.6h.8": "I heard Maru and Sam arguing about if chickens came first or eggs did. It sort of devolved into Maru yelling eggs come first, and Sam yelling chickens come first. Then Juliet started laughing and wouldn't explain why.$7",
"Antoine.Summer.6h.9": "@! There were trees on the moon! I read online how the first astronauts grew some up there.$l#b#They were donated to a forestry center. Maybe I should visit them sometime?#h",
"Antoine.Summer.6h.10": "It got so hot last night I actually took a nap inside my fridge. Hmm? Yes, I know it's too small to fit a body.$h",
"Antoine.Summer.6h.11": "Ha ha, Eloise asked me if putting a bird house on a branch would make it go up too high when the tree grows. I told her that trees grow pretty slowly, but they also grow from the top. So the bird house won't go anywhere unless the wind blows it off.$h",
"Antoine.Summer.6h.12": "So, Juliet brought home some lemon juice, but it said it had artificial flavors. Which I find really strange, because Jessie brought home dish soap and it had real lemons in it.$7",
"Antoine.Summer.6h.13": "Carrots used to be purple instead of orange. They tasted pretty bitter, so people only cultivated the yellow carrot. Everyone worked very hard to make carrots tasty.$h",

/*/ 6-Hearts ~ Fall /*/
"Antoine.Fall.6h.1": "Traditionally, this time of year my family and I would bless all the forage in the forest so that they get really plump and juicy. We'd have a little contest about who could make something grow the biggest!$h",
"Antoine.Fall.6h.2": "I've always had mixed feelings about this time of year. Everything needs to change in order to grow, but also I miss what we lose in the process.$0",
"Antoine.Fall.6h.3": "%Antoine seems extra focused today. On what you have no idea.#b#Huh? What am I thinking about? I'm trying to decide if I want glazed yams or baked yams for dinner.$0",
"Antoine.Fall.6h.4": "Fall leaves have all those colors inside of them all year round, but we only get to see it when they are about to let out their last breath.$h",
"Antoine.Fall.6h.5": "It's really too bad that red mushrooms are poisonous. They make a really tasty gravy.$0",
"Antoine.Fall.6h.6": "Vincent swallowed some gum yesterday and thought he was going to die because it was going to plug up his organs.$2#$b#Luckily Dr. Harvey was close by help by pretending he was giving him a piece of candy that would melt the gum in his stomach.$h",
"Antoine.Fall.6h.7": "Do you know why owls can turn their head all the way around? It's because their eyes are tubes instead of balls.$l",
"Antoine.Fall.6h.8": "I spent a few hours yesterday just listening to Juliet and Rosa debate if cereal counts as a soup or not. Juliet was staunchly pro soup, but honestly it seems too chunky to be a soup. Maybe a stew?$7",
"Antoine.Fall.6h.9": "Have you ever seen a Guinea pig popcorn? It's when they get so excited they jump into the air like a kernel of popcorn. Horses can do it too. It's so cute!$h",
"Antoine.Fall.6h.10": "The wizard says that space tastes like salmonberries. Now I just want to make a tart out of the galaxy.$u",
"Antoine.Fall.6h.11": "Hmm, I wonder how many days do you think it takes you to scroll a mile on my phone?$7",
"Antoine.Fall.6h.12": "I remember when people thought the sky was actually another sea, like the ocean, and stars were just floating in it. It's a nice idea, isn't it? Just making a ship and sailing to the moon?$h",
"Antoine.Fall.6h.13": "I worry sometimes that people will never be able to live together peacefully, but it's comforting to know everyone will at least try.$0",

/*/ 6-Hearts ~ Winter /*/
"Antoine.Winter.6h.1": "I learned yesterday that snow isn't white. It's actually clear and the light reflecting off of it makes it white. Just, uh, don't stare at it too long or you can go blind.$7",
"Antoine.Winter.6h.2": "%Antoine smiles at you, but doesn't really feel like talking today.",
"Antoine.Winter.6h.3": "Last night I was wondering if I'm actually alive or if I'm just existing. I want to think that I'm alive, but then I would think that, right? I didn't get much sleep.$s",
"Antoine.Winter.6h.4": "It's so cold! Too cold! I can't wait for it to be warm again!$a",
"Antoine.Winter.6h.5": "The valley has a pretty interesting natural resource in the winter time. Saffron is the stigma of the crocus flower. It's pretty hard to make a lot of it through. It takes over 70,000 flowers to just make a pound of it.$0#b#It'd be pretty impossible to make enough for everyone in town to use.$s",
"Antoine.Winter.6h.6": "You know, if I had to replace my left hand with a kitchen tool I think it would be a chef's knife.#b#Though, a serrated knife would be good too...$7",
"Antoine.Winter.6h.7": "I went into a room this morning and forgot why I was there, which had me pretty confused because my house is just one big room.$s",
"Antoine.Winter.6h.8": "Do you think people would be upset if I took home a pepper rex? This time of year that fire breath would be really nice to have around.$0",
"Antoine.Winter.6h.9": "Do you think how we perceive reality is accurate? Everything is so subjective it's impossible to know for sure.$6",
"Antoine.Winter.6h.10": "Have you ever just cooked up a bunch of yams, crushed them up into a big bowl with honey, and just dug into it with your hands? It's so warm.$0",
"Antoine.Winter.6h.11": "All trees are mostly dead. The only parts of a tree are alive are the important parts. The leaves, buds, and roots. The rest of the tree is just a bunch of dead cells that it holds onto for years and years.$6",
"Antoine.Winter.6h.12": "Gus said the taste of Pam's tuna casserole was indescribable, which I find really confusing. Didn't he just describe it?$7",
"Antoine.Winter.6h.13": "Hey, @. When you hear the word life, what do you think about?$7#b#It always fills me with joy. I always try and remind myself of that.$h",
"Antoine.Winter.6h.14": "Last night I was wondering if I'm actually alive or if I'm just existing. I want to think that I'm alive, but then I would to think that, right? I didn't get much sleep.$s",
"Antoine.Winter.6h.15": "I went into a room this morning and forgot why I was there, which had me pretty confused because my house is just one big room.$s",

/*/ 8-Hearts ~ Spring /*/
"Antoine.Spring.8h.1": "I remember when people thought the sky was actually another sea, like the ocean, and stars were just floating in it. It's a nice idea, isn't it? Just making a ship and sailing to the moon?$h",
"Antoine.Spring.8h.2": "Have you ever heard of the The Trembling Giant? It's a group of trees that have outlived everything else around it for centuries. They look like a forest, but they aren't. All of their roots are connected. So they're just one big organism.$h",
"Antoine.Spring.8h.4": "You know, I've thought a lot about what makes something a person. If it's their mind or their body. I'll let you know if I figure out an answer to that.$h",
"Antoine.Spring.8h.6": "I had a dream last night that I was still stuck in a dream and couldn't wake up. Am I even awake now?9",
"Antoine.Spring.8h.8": "You're really brave, you know that? You dropped your entire life to come a build a new one that would make you happier. I really admire you.$h",
"Antoine.Spring.8h.10": "You know, for thousands of years each generation had lives that was really similar to one another. Technology really shook that up, huh?$h",
"Antoine.Spring.8h.11": "Your hair looks really nice today!$h",

/*/ 8-Hearts ~ Summer /*/
"Antoine.Summer.8h.1": "I spoke with the large tree in Cindersnap the other day, and did you know it's been in the valley for over five thousand years? It had so many fascinating things to talk about.$h",
"Antoine.Summer.8h.2": "I learned something really cool. Metal can weld itself in space through cold welding.$l#b#I feel like metal could weld itself here on a day like this.$h",
"Antoine.Summer.8h.3": "There's a large plant in the jungle that attracts bugs to eat by smelling like a rotting corpse. Flowers can be so resourceful, can't they?$h",
"Antoine.Summer.8h.4": "The goats in the mountain above East Scarp have such a strange accent.$7",
"Antoine.Summer.8h.5": "Dinosaur plants can bring themselves back from the dead. They can be without water for months, just sitting in a curled up dry ball. Then as soon as moisture hits them they spring back to life.$l#b#I've seen people do that too.$h",
"Antoine.Summer.8h.6": "Oh! Did you know that glass is an amorphous solid?$l#b#That means it's not a solid or a liquid. It just. Is. I like that idea a lot.$h",
"Antoine.Summer.8h.7": "Ha ha, I've thought about saying Ahoy-hoy instead of Hello on the phone, but I don't think a lot of people would get the reference.$h",

/*/ 8-Hearts ~ Fall /*/
"Antoine.Fall.8h.1": "Orange fruits and vegetables are so energetic. It's no wonder why so many oranges want to be orange instead of green.$h",
"Antoine.Fall.8h.2": "Do you think people are ants trying to understand math? Is it possible for people to really understand the full depths of reality? I wonder about that sometimes.$7",
"Antoine.Fall.8h.3": "Did Hannah see bees? Hannah did. Ha ha, palindromes are so fun.$h",
"Antoine.Fall.8h.4": "There is a mushroom that excused thick red sap. Some people call it Strawberries and Cream while others call it Bleeding Tooth Fungus. It's interesting how people can see the same thing and yet see something totally different.$7",
"Antoine.Fall.8h.6": "You know, apples are a members of the rose family. I try to remember that when I'm feeling down about how I look.$h",
"Antoine.Fall.8h.7": "You need saliva to actually taste food. It's almost as important as a sense of smell.$h",
"Antoine.Fall.8h.8": "Be careful when you're upsetting crows. They can hold a grudge.$s",

/*/ 8-Hearts ~ Winter /*/
"Antoine.Winter.8h.1": "I can't stand Cranberry Candy. The cranberry part is fine, but the apples? Ugh, it just makes me think of $8",
"Antoine.Winter.8h.2": "One day all of the stars will crash into one another creating total chaos. I'm glad I'll never be around to see that.$0",
"Antoine.Winter.8h.4": "There was a time when surgeons were trained to block out the screams of human pain. Can you imagine having to learn how to do that to be a doctor?$7",
"Antoine.Winter.8h.5": "When a person is blindfolded they just gradually walk in a circle. They need to be able to see in order to walk anywhere with direct purpose. Sometimes I feel like I'm blindfolded too and I can't seem to take it off.$6#b#But then I have a nap and a snack and I usually feel better.$0",
"Antoine.Winter.8h.6": "I read that shadows are darker on the moon than they are here. There's no light to distribute through the atmosphere there.$s",
"Antoine.Winter.8h.7": "There are more trees in the world than there are stars in the sky. Just something I think about sometimes.$0",
"Antoine.Winter.8h.8": "I read that icebergs fizz like soda as they melt. I thought that was kind of neat.$0",

/*/ 10-Hearts ~ Spring /*/
"Antoine.Spring.10h.1": "Eye of newt, toe of frog, and wool of bat are just an old way of saying mustard seed, buttercup, and holly leaves.$h",
"Antoine.Spring.10h.2": "Have you ever tried playing music for your cows? I heard they make more milk if you do. Let me know if that's true, okay?$7",
"Antoine.Spring.10h.3": "Ha ha, I mentioned my chicken fried steak recipe to the kids in my class and they all wanted to know how chickens can fry a steak.$h",
"Antoine.Spring.10h.4": "Color plays such an important part in taste. We all have our preconceived notions of what should taste like what and our brains will lie to us to make sure that stays true.$0#b#But then our brains like to lie about all sorts of things to protect our world view, doesn't it?#h",
"Antoine.Spring.10h.5": "I used to watch people take pictures with the most sour faces on. Smiling wasn't in fashion so they'd say prunes to keep their frown on. I'm glad no one does that anymore.$h",
"Antoine.Spring.10h.6": "I learned something really neat last night! The biggest waterfall in the world is actually under the water. Isn't that wild?$l",
"Antoine.Spring.10h.7": "Have you ever found a huge murder in your yard? I found one in mine and all of my vegetables were picked clean. Crows are really obnoxious sometimes.$8",

/*/ 10-Hearts ~ Summer /*/
"Antoine.Summer.10h.1": "I hear the tanks our military is using are equipped to make tea. So that's something, I guess.$8",
"Antoine.Summer.10h.2": "People used to use corncobs before toilet paper was invented. So, uh, be glad that's not a thing anymore.$8",
"Antoine.Summer.10h.3": "Cucumbers are good for bad breath.$0#b#No, I'm not staying that for any specific reason. Just thought it was neat.$h",
"Antoine.Summer.10h.4": "Oh, I learned something neat. The dot over the letter \"I\" is called a tittle.$h#b#You're the first person I've told that to that hasn't laughed for some reason.$7",
"Antoine.Summer.10h.5": "The next time you cut yourself you should get out some sugar. The granules absorb any moisture that the bacteria would live on. But don't use that as an excuse not to see Dr. Harvey.$h",
"Antoine.Summer.10h.6": "Snails have teeth. 2,500 of them. That's more than even a shark has. They both use them to crush up their food though. So even sharks and snails can have something in common.$h",
"Antoine.Summer.10h.7": "If you don't like horror movies you should go see some abstract art afterward. Oddly enough you'll probably like the art more.$h",

/*/ 10-Hearts ~ Fall /*/
"Antoine.Fall.10h.1": "It must be so dizzying to be a bee. Their eyes composite 5000 individual images. I think that would drive me nuts.$s",
"Antoine.Fall.10h.2": "I learned something cool online. A jiffy is actually a unit of time. It's 1/100th of a second.$l",
"Antoine.Fall.10h.3": "The backwards quotation mark is supposed to denote irony, but ironically no one really seems to use it.$h",
"Antoine.Fall.10h.4": "Some trees can change their gender from one season to the next. I always found that kind of inspiring.$h",
"Antoine.Fall.10h.5": "Honey is very cool. It never expires, you don't have to keep it cold to be fresh, and it can't fully freeze. It turns into a sort of gelatin instead.$h",
"Antoine.Fall.10h.6": "Whatever you do DON'T put grapes in the microwave. They explode!$9#b#Don't, uh, don't ask me how I know that.$s",
"Antoine.Fall.10h.7": "You know, vacuums used to be huge. You needed horses to take one to someone's house and professional put the hose in through your window. They've sure come a long way, huh?$h",

/*/ 10-Hearts ~ Winter /*/
"Antoine.Winter.10h.1": "To prevent predators from finding them geckos will eat their own skin when they shed it. That's kind of poetic, isn't it?$0",
"Antoine.Winter.10h.2": "A snail can take a nap that lasts for three years. Something I wish I could do that too.$h",
"Antoine.Winter.10h.3": "Before I became human I spent a lot of time around people, learning anything I could from them, but totally unable to ask questions.$s#b#I can ask lots of questions now, but I'm starting to learn that some of them really shouldn't be asked.$6",
"Antoine.Winter.10h.4": "I don't know if I'll still be aware after death, but I hope not. Imagine everything ending and still being aware for millions of years with nothing around you.$6",
"Antoine.Winter.10h.5": "Some days I feel like I'm just waiting for something, and I can't do anything else while I wait, but there's nothing that I'm actually waiting for. Rather than dwell on it I just look at memes on the Internet and hope I don't feel like that after a night's sleep. That helps reset my brain, I guess.$s",
"Antoine.Winter.10h.6": "Man, frozen meals are really depressing. I really should just make a whole bunch of stuff in fall to just reheat for the winter.$s",
"Antoine.Winter.10h.7": "I can't wait for spring to get here so I can get out of this fog.$s",


//Rainy Dialogue

"Antoine.Rainy.Spring.1": "Ah, it's raining today. It feels really nice.$1",
"Antoine.Rainy.Summer.1": "Mmm, it's really hot today, so this rain feels really good.$1",
"Antoine.Rainy.Fall.1": "Phew, it's getting pretty cold, isn't it? The rain is still pretty nice though.$1",
"Antoine.Rainy.Spring.3h.1":  "The rain feels so nice when it's warm outside, but getting my clothes wet is so uncomfortable. $1#$b#I wish I could walk around in it without them, but the last time I tried I got a lot of funny looks.$1",
"Antoine.Rainy.Summer.3h.1": "Ah, thank goodness, some refreshing rain.$1",
"Antoine.Rainy.Fall.3h.1": "Normally I really like the rain, but when the weather gets like this it feels a bit too cold.$1",
"Antoine.Rainy.Spring.6h.1": "Do you like going out in the rain too? I see you out in it a lot.$1",
"Antoine.Rainy.Summer.6h.1": "Ahhhh, the rain feels so good! Don't you think so, @?",
"Antoine.Rainy.Fall.6h.1": "Ugh, it's getting colder again. I love all the fruit and forage you can find in the fall, but I really wish it'd just stay warm.$0",
"Antoine.Rainy.Spring.10h.1": "%Antoine is happily humming to himself and doesn't seem to notice you.",
"Antoine.Rainy.Summer.10h.1": "On a day like today, the rain is really welcome. Don't you think?$1",
"Antoine.Rainy.Fall.10h.1": "Everyone seems to stay inside when it's raining, but I want to enjoy it before it turns to ice.$0",

//Snowing Dialogue
"Antoine.Snowy.1": "Oh, you came all the way to my home just to visit me? You must be freezing! Would you like a hot drink?$0",
"Antoine.Snowy.2": "I was wondering if you were going to come visit me today. I guess my schedule is kind of predictable when it comes to the snow, huh?$0",
"Antoine.Snowy.3": "One day I'll be able to go outside while it's snowing, but that's definitely not today.$0",

//Before Festival Dialogue
"Antoine.PreEgg.1": "A whole festival all about eggs! I'm so excited! What a fun thing to celebrate!$1",
"Antoine.PreFlower.1": "I'm looking forward to tomorrow, I got my blue suit pressed and everything!$1",
"Antoine.PreLuau.1": "What do you plan to bring for the soup tomorrow? I wanted to bring a giant melon, but I don't think it'll fit in the pot. Maybe if I hit it with an axe?$1",
"Antoine.PreJelly.1": "Ah, the jellyfish are already excited for tomorrow. They want to put on a good show for everyone.$1",
"Antoine.PreFair.1": "Tomorrow will be so fun! Do you have any fruit for the display?$1",
"Antoine.PreSpirit.1": "I wish people could celebrate monsters all year round. Maybe they'd be nicer to them. $0#$b#I'm going to stay behind at the Inn when this is over so I can help clean up.$1",
"Antoine.PreIce.1": "I hope you have a lot of fun at the festival! It's way too cold for me.$0",
"Antoine.PreFeast.1": "A whole feast! I'm definitely going to have to brave the cold to make it!$1",

"Antoine.PreEgg.3H.1": "I wish I could do some special magic at the festival tomorrow, but I'm not sure how people would take it.$1",
"Antoine.PreFlower.3H.1": "Last night the flowers were very excited, I think they love the dance as much as everyone else here does.$1",
"Antoine.PreLuau.3H.1":"Are you looking forward to all of that food tomorrow? I bet the leftovers keep you fed for weeks.$1",
"Antoine.PreJelly.3H.1": "",
"Antoine.PreFair.3H.1": "",
"Antoine.PreSpirit.3H.1":"Tomorrow everyone gets to dress up as monsters or fairies or princesses. Really anything they want.#$B# I'm glad people are so comfortable turning into something else here, even if it's just for one night.",
"Antoine.PreIce.3H.1": "",
"Antoine.PreFeast.3H.1":"Tomorrow is going to have a lot of strange energies. It happens every year and I never really know what to make of it. At least everyone seems really happy. #$b#At least the food is always extra delicious. Maybe that has something to do with it?",


"Antoine.PreEgg.6H.1": "It's the egg festival! The festival of eggs! I'm excited, are you excited, eggs, eggs, eggs!",
"Antoine.PreFlower.6H.1": "You know, I'm not sure flowers like dancing. I invite them every year and they never show up!",
"Antoine.PreLuau.6H.1": "I got something really nice for the soup this year! Now I just have to manage to not eat it before tomorrow.",
"Antoine.PreJelly.6H.1": "I love how calm and awe filled the night is when the Moonlight Jellies put on their show for everyone.",
"Antoine.PreFair.6H.1": "I can't wait to see your display! I bet it'll be full of tasty, pretty things!",
"Antoine.PreSpirit.6H.1": "OoOOooOOoo is spooky. OooOOoOooOoo is scary. OoooOoooOO BOO!",
"Antoine.PreIce.6H.1": "Have fun at the festival tomorrow! I'm going to stay home with some hot coco.",
"Antoine.PreFeast.6H.1": "I know there's more about the feast than just, well, the feast part, but that's all I can ever think about! I guess I'm just not in a giving mood when it's so cold out.",


"Antoine.PreEgg.10H.1": "I invited my family to the festival, but I think they'll only get to be there in spirit. Ha, get it?",
"Antoine.PreFlower.10H.1": "The flower dance is going to be extra special tomorrow. I can't wait!",
"Antoine.PreLuau.10H.1": "I'm afraid to invite my family to the Luau. One time I attended it when I was in my old form and a kid tried to throw me into the pot!",
"Antoine.PreJelly.10H.1": "My family comes to watch the jellies every year! They like to make the lanterns shine brighter.",
"Antoine.PreFair.10H.1": "I invited my family to see the fair, but I think it gets too busy for them to stick around for long.",
"Antoine.PreSpirit.10H.1": "My family loves the fun festivals you all put together, but this one is their favorite. They always dress up as spiders!",
"Antoine.PreIce.10H.1": "",
"Antoine.PreFeast.10H.1": "I thought about inviting my family to the feast, because it's all about togetherness, but it'd be way too cold for them.",












/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                                                            :: */
/* ::  88      dP"Yb   dP""b8    db    888888 88  dP"Yb  88b 88    db    88      :: */
/* ::  88     dP   Yb dP   `"   dPYb     88   88 dP   Yb 88Yb88   dPYb   88      :: */
/* ::  88  .o Yb   dP Yb       dP__Yb    88   88 Yb   dP 88 Y88  dP__Yb  88  .o  :: */
/* ::  88ood8  YbodP   YboodP dP""""Yb   88   88  YbodP  88  Y8 dP""""Yb 88ood8  :: */
/* ::                                                                            :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */

//Saloon 
"Antoine.Saloon.1": "One time I listened to Gus and Pam debate for hours if cereal counts as a soup or not. Pam was staunchly pro soup, but honestly it seems too chunky to be a soup. Maybe a stew?$7",
"Antoine.Saloon.2": "I asked Demetrius once what radioactive vegetables would taste like, and he said that it wouldn't taste like anything, and in fact, we'd never know if it was irradiated at all. How spooky.$7",
"Antoine.Saloon.3": "I heard Maru and Sam arguing about if chickens came first or eggs did. It sort of devolved into Maru yelling eggs come first, and Sam yelling chickens come first. Then Abigail started laughing and wouldn't explain why.$7",
"Antoine.Saloon.4": "You know, the sun looks bigger during the winter. Demetrius says it's because the sun is closer to us, but it sure doesn't make things any warmer.$2",
"Antoine.Saloon.5": "I accidentally startled Haley the other day by watering a flower while she was trying to take a picture of some birds. She had some ... opinions about it.$s",
"Antoine.Saloon.6": "Do you know what to cook with cactus fruit? Emily brought some back with her when she went to visit her friend in the Calico Desert, and was very kind to give me some.$h",
"Antoine.Saloon.7": "Why do people complain about burning when they eat hot peppers? They don't seem that hot to me.$7#$b#Emily said that birds don't think hot peppers are hot either.$h",
"Antoine.Saloon.8": "Gus says that coffee stays warmer if you add cream to it. I wonder if that applies to hot chocolate too?$0",
"Antoine.Saloon.9": "Gus said the taste of Pam's tuna casserole was indescribable, which I find really confusing. Didn't he just describe it?$7",
"Antoine.Saloon.10": "Vincent swallowed some gum yesterday and thought he was going to die because it was going to plug up his organs.$2#$b#Luckily Dr. Harvey was close by. He pretended he was giving him a piece of candy that would melt the gum in his stomach. Vincent perked right up.$h",
"Antoine.Saloon.11": "I wonder why Abigail laughs when I talk about how big eggplants are?$7",
"Antoine.Saloon.12": "I was telling Eloise and Jas that holly is actually a stone fruit, but then Vincent wanted to some. Luckily Penny managed to stop him in time.$0",
"Antoine.Saloon.13": "You know, Pierre and Morris seem to really hate each other even though they have a lot in common. If they just sat down and talked they could probably be good friends.$7",
"Antoine.Saloon.14": "I love watching Gus work in his back yard. Blacksmithing is a rare talent, and the coolest part is that it uses all four elements to forge something.$h",
"Antoine.Saloon.15": "Do you ever take a second to play pool at the table over there? No? Me either. I always feel like it'd be rude to touch it.$0",
"Antoine.Saloon.16": "Demetrius says that potatoes were the first vegetable they grew in space. Isn't that neat?$l",















/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                                            :: */
/* ::  Yb        dP 888888    db    888888 88  88 888888 88""Yb  :: */
/* ::   Yb  db  dP  88__     dPYb     88   88  88 88__   88__dP  :: */
/* ::    YbdPYbdP   88""    dP__Yb    88   888888 88""   88"Yb   :: */
/* ::     YP  YP    888888 dP""""Yb   88   88  88 888888 88  Yb  :: */
/* ::                                                            :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */

//Note: Antoine does NOT like being out in the snow. 

//He stills goes out to do his rounds, but if it's possible to code this, he would stay indoors as much as possible. 

//I've added some alternative text for when he's inside. It's commented out so that it doesn't potentially break anything.

"Antoine.Snow.1": "Ugh. It's already too cold when ice isn't falling out the the sky.$s",
"Antoine.Snow.Indoor.1": "Oh, you came all the way to my home just to visit me? You must be freezing! Would you like a hot drink?$0",
"Antoine.Snow.2": "%Antoine looks pretty grumpy. He probably doesn't want to talk to you.",
"Antoine.Snow.Indoor.2": "I was wondering if you were going to come visit me today. I guess my schedule is kind of predictable when it comes to the snow, huh?$0",


//Note: Antoine loves the rain and may be outside more often than is usual for his schedule on rainy days in spring and summer.

"Antoine_Rain.000.1": "Ah, thank goodness, some refreshing rain.$1",
"Antoine_Rain.001.1": "The rain feels so nice when it's warm outside, but getting my clothes wet is so uncomfortable. $1#$b#I wish I could walk around in it without them, but the last time I tried I got a lot of funny looks.$1",

"Antoine_Snow.000.2": "Ugh, the ice is stinging my face. I should just go back inside.$a",
//Indoor Alt: "Antoine_Snow.000.2": "Oh, I'm sorry, @! If I'd known you were coming over I wouldn't have finished off all of my hot chocolate.$s",
"Antoine_Snow.001.2": "%Antoine is fully focused on just walking forward and completely ignores you.",
//Indoor Alt: "Antoine_Snow.000.2": "Hey, @. I sort of had a feeling you might be by today so I made some extra glazed yams for you. I even managed to not eat them![208]",  //Note: Antoine is meant to give the farmer glazed yams after saying this.

"Antoine_Rain.000.2": "Ahhhh, the rain feels so good! Don't you think so, @?",
"Antoine_Rain.001.2": "%Antoine is happily humming to himself and doesn't seem to notice you.",

"Antoine.Saloon.Winter.1": "Everyone insisted I get out today",





/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                                              :: */
/* ::  8b    d8    db    88""Yb 88""Yb 88    db     dP""b8 888888  :: */
/* ::  88b  d88   dPYb   88__dP 88__dP 88   dPYb   dP   `" 88__    :: */
/* ::  88YbdP88  dP__Yb  88"Yb  88"Yb  88  dP__Yb  Yb  "88 88""    :: */
/* ::  88 YY 88 dP""""Yb 88  Yb 88  Yb 88 dP""""Yb  YboodP 888888  :: */
/* ::                                                              :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */


"Rainy_Day_0": "Are you going out today? Me too!$h",
"Rainy_Day_1": "The rain is so comforting. I could listen to it all day.$h",
"Rainy_Day_2": "I always find that the day after a nice rain is just as refreshing as the rainy day itself. $h",
"Rainy_Day_3": "Did you know that the rain is actually good for you? It can help you sleep better and make you feel more relaxed.$h",
"Rainy_Day_4": "Light tastes different when it's filtered through a rain cloud. I wish I could share that taste with you.$h",
"Rainy_Day_5": "Do you hear that? The plants are singing. They really needed this.$h",
"Indoor_Day_0": "...$0",
"Indoor_Day_1": "...$0",
"Indoor_Day_2": "...$0",
"Indoor_Day_3": "...$0",
"Indoor_Day_4": "...$0",
"Indoor_Day_5": "...$0",
"Rainy_Night_0": "...$0",
"Rainy_Night_1": "...$0",
"Rainy_Night_2": "...$0",
"Rainy_Night_3": "...$0",
"Rainy_Night_4": "...$0",
"Rainy_Night_5": "...$0",
"Indoor_Night_0": "...$0",
"Indoor_Night_1": "...$0",
"Indoor_Night_2": "...$0",
"Indoor_Night_3": "...$0",
"Indoor_Night_4": "...$0",
"Indoor_Night_5": "...$0",
"funLeave_{{ModId}}_Antoine": "...$0",
"funReturn_{{ModId}}_Antoine": "...$0",
"Outdoor_{{ModId}}_Antoine": "...$0",
"Outdoor_0": "...$0",
"Outdoor_1": "...$0",
"Outdoor_2": "...$0",
"Outdoor_3": "...$0",
"Outdoor_4": "...$0",
"spouseRoom_{{ModId}}_Antoine": "...$0",
"OneKid_0": "...$0",
"OneKid_1": "...$0",
"OneKid_2": "...$0",
"OneKid_3": "...$0",
"OneKid_4": "...$0",
"TwoKids_0": "...$0",
"TwoKids_1": "...$0",
"TwoKids_2": "...$0",
"TwoKids_3": "...$0",
"TwoKids_4": "...$0",
"Good_0": "...$0",
"Good_1": "...$0",
"Good_2": "...$0",
"Good_3": "...$0",
"Good_4": "...$0",
"Good_5": "...$0",
"Good_6": "...$0",
"Good_7": "...$0",
"Good_8": "...$0",
"Good_9": "...$0",
"Neutral_0": "...$0",
"Neutral_1": "...$0",
"Neutral_2": "...$0",
"Neutral_3": "...$0",
"Neutral_4": "...$0",
"Neutral_5": "...$0",
"Neutral_6": "...$0",
"Neutral_7": "...$0",
"Neutral_8": "...$0",
"Neutral_9": "...$0",
"Bad_0": "...$0",
"Bad_1": "...$0",
"Bad_2": "...$0",
"Bad_3": "...$0",
"Bad_4": "...$0",
"Bad_5": "...$0",
"Bad_6": "...$0",
"Bad_7": "...$0",
"Bad_8": "...$0",
"Bad_9": "...$0",



/* :::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                                  :: */
/* ::  .dP"Y8 888888 88""Yb 88 88b 88  dP""b8 .dP"Y8   :: */
/* ::  `Ybo."   88   88__dP 88 88Yb88 dP   `" `Ybo."   :: */
/* ::  o.`Y8b   88   88"Yb  88 88 Y88 Yb  "88 o.`Y8b   :: */
/* ::  8bodP'   88   88  Yb 88 88  Y8  YboodP 8bodP'   :: */
/* ::                                                  :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::: */

/*/ Animation /*/
	//TOO BUSY FOR FARMER      //These are intended to be used with Antoine's casting and Headphones animations to indicate to the farmer that he either can't talk right now, or doesn't notice them.

	//Antoine Busy Casting
	"Antoine.BusyCasting.01": "%Antoine smiles at you, but is too busy casting to speak to you right now.",

	//Antoine Listing to Headphones
	"Antoine.GoodTunes.01": "%Antoine is too engrossed in his music to notice you.",


/*/ Maps /*/
	//LAPTOP COMMENTARY      //These would be in his laptop animation if you interact with Antoine while he's typing.
	//Cat Video "Flower Crashes Cat" - https://www.youtube.com/watch?v=ncNwe13rguE
	"Antoine.Atlaptop.01": "Have you seen this video, @? A girl is singing a folk song to her cat, then puts a flower put on top of it's head and gets a look of existential dread, like it's seeing straight into the heart of the universe. It's pretty funny.$h",


//READING A BOOK        //When Antoine is chilling out and reading a book he would love to tell the Farmer all about what he's reading.
	//Generic Book
	"Antoine.ReadBook.01": "Hi, @. I'm sort of absorbed in this book here. I hope you don't mind.$0",
    "Antoine.ReadBook.02": "I'm reading a really interesting book on echolocation. Ha ha, it certainly explains why bats seem to speak so loudly.$h",
    "Antoine.ReadBook.03": "This book? It's about the pros and cons of syllabaries vs. alphabets vs. glyphs. Alphabets are quite limiting with roughly only 100 symbols to convey language, but syllabaries can have several hundreds more. It'd be quite intimidating to learn them all.$0",
    "Antoine.ReadBook.04": "Hmm? Oh, this is less of a book and more of an essay about why bicycles just never caught on in Stardew Valley.$0",

    //Elliott's Book
    "Antoine.ReadElBook.01": "Oh, I'm reading %book. Elliott should be very proud of it, he's an exceptional writer.$0",

    //Rodney's Book
    "Antoine.ReadRBookDwarf.01": "Ah, this is the book Rodney wrote about, ah, I probably shouldn't say their name. I don't think they know it's about them anyway.$0",

    "Antoine.ReadRBookShadow.01": "This book is very ... well Rodney certainly has an interesting take on shadow folks.$h",


//TOO DAMN COLD

	//Antoine Busy Casting - Winter Edition
	"Antoine.BusyCastingBrr.01": "%Antoine ignores you because he's is too busy casting to speak to you right now.",
	
	//Antoine Listing to Headphones - Winter Edition
	"Antoine.GoodTunesBrr.01": "%Antoine looks sort of miserable and definitely doesn't want to talk right now.",











/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* ::                                                    :: */
/* ::  88     888888 888888 888888 888888 88""Yb .dP"Y8  :: */
/* ::  88     88__     88     88   88__   88__dP `Ybo."  :: */
/* ::  88  .o 88""     88     88   88""   88"Yb  o.`Y8b  :: */
/* ::  88ood8 888888   88     88   888888 88  Yb 8bodP'  :: */
/* ::                                                    :: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::: */
/* :::::::::::::::::::::::::::::::::::::::::::::::::::::::: */


/*/----------Fun----------/*/
    
    "Antoine.Mail.First": "Dear @,^^I know it may seem a little silly to send you a letter when we live in the same town, but I've always wanted to do this. I understand it's a little bit silly to send these when more instant forms of communication exist. There's just something so cool about it, and you live across town so it's sort of like having a penpal that I can see the face of every day! I hope you don't mind, and you don't have to reply if you don't want to. Or you can just send me a text or an email instead of a physical letter. Or come and talk to me. ^^Sincerely, Antoine[letterbg 2][#]My First Letter",

    "Antoine.Mail.BackHome": "Dear @,^^I was thinking about my old home today and I felt a little melancholy. I love it here, but there are so many things I miss about where I came into being. I was there for such a long time, and while everything now is new and exciting, sometimes I just want the comfort of how things used to be. Which is so strange because I was often quite sad.^^See, I was always enamored with humans. For as long as I can remember. I  spent so much time in human towns I practically lived in them. I couldn't really be seen, but sometimes a kid would spot me and wave. It was lonely. Knowing that I was a person like you, but not being able to touch or talk to one.^^My family didn't really understand, but I never expected them to. They were happy with how they were created. They liked people, and liked to help them, but nature was where they belonged. Not stone streets and wooden houses with fires inside cooking delicious smelling things. I'm so much happier now. I have friends, and wonderful conversations, and food is just so good. So why do I miss a place where I only pined for what I have now? It's so very strange.^^Sincerely, Antoine[letterbg 2][#]I don't know why I miss it.[letterbg 2][#]I don't know why I miss it.",

    "Antoine.Mail.SoConfused": "Dear @,^^I was out with Juliet today and Haley asked me to model for some pictures! It was really fun, and she was very nice to me. She was complimenting my hair, and my form, and she thought my eyes were very nice too. It felt good getting those kinds of compliments, but Juliet kept thinking they were funny. I like her laugh, so I didn't mind, but it really frustrated Haley.^^When Haley got some close-up pictures of me she fixed up my hair and took her time helping me to take off my coat so that I could move better to do other kinds of poses. She was very friendly, and she seemed to really enjoy the pictures she took of me, but Juliet just laughed the whole time. Then, when Haley asked if I wanted to eat something with her Juliet said she was barking up the wrong tree?^^I don't get it. I like getting to sample new foods, and Haley seemed like she would have a lot of fun things to talk about. Since I was spending time with Juliet today I left with her when she wanted to leave and Haley seemed unhappy about something and went home. Later I asked Juliet  why she was laughing, and said those things to Haley. She told me that I shouldn't confuse the poor girl, but I'm the one that's confused. I hope Haley isn't too upset, but I'm really excited to see the pictures later!^^Sincerely, Antoine[letterbg 2][#]I'm really confused.",

    "Antoine.Mail.NotEvenBerries": "Dear @,^^I heard Pierre say that strawberries are the only fruit that have their seeds on the outside, but that's not true! See, the outside of a strawberry is actually covered in a bunch of tiny dried fruits. The seeds are on the inside of those fruits. Pretty cool, huh?^^They aren't berries either. They're a part of the rose family. Tomatoes are a berry though. Eggplants too!^^Sincerely, Antoine[letterbg 2][#]Berry Fun Facts",

    "Antoine.Mail.Glasses": "Dear @,^^Jas asked me why I was wearing glasses if I didn't need them to see. Is that what glasses do? I had no idea! She was very informative about the specific function of glasses and it was so helpful. I just saw them in the river and thought they looked neat!^^Sincerely, Antoine[letterbg 2][#]My glasses. I can see without my glasses.",

    "Antoine.Mail.Sunflowers": "Dear @,^^I woke up this morning to a hundred tiny voices singing to the sun. I always love it when sunflowers announce that summer is finally here. They have so much personality! Young sunflowers love watching the sun, and when they mature they always look off to the east together. ^^The head of the sunflower is a combination of a thousand tiny flowers. The petals are one of those flowers too, they just got out of their shell to say hello to the world!^^I really admire sunflowers. It took me way too long to do that for myself.^^Sincerely, Antoine[letterbg 2][#]The sunflowers are here!",

    "Antoine.Mail.Roses": "Dear @,^^Fairy roses have been around longer than even ancient fruit. They've seen the world grow to be so big, and they've never forgotten it. One fairy rose can live for a thousand years. The old ones always have such strange songs, really haunting, but lovely too. As sweet as how they smell. ^^Sometimes I know the songs so well I end up humming them when I'm around the young fairy roses. I wonder if that's like teaching them the old ways?^^Sincerely, Antoine[letterbg 2][#]Old Roses",

    "Antoine.Mail.LadyShiba": "Dear @, ^^Thanks a lot for helping that poor cat! I've been sneaking cheese to it whenever I can, but Jacob said that cheese isn't great for animals in large amounts. That seemed to be the only thing the poor kitty would take from me though, and even then only at a distance. Usually animals aren't afraid of me at all, so I hope it didn't have a really bad life before coming here.^^Sincerely, Antoine[letterbg 2][#]Stray No More",

    "Antoine.Mail.Aideen": "Dear @, ^^I've seen Aideen spending a lot of time with Dr. Luis lately. Aideen is so smart and sweet natured, and Dr. Luis has a lot of energy and fun stories, I think they'll be really good friends soon! It's so great that Aideen is opening herself up to more friendship!^^Juliet says that Dr. Luis is Aideen's new bow. Do you think she meant that he wants to take Aideen to the caves with him? I'm not sure how she can be a bow, but then I can make tiny clouds rain over flowers, so I really can't be too judgemental.^^Sincerely, Antoine[letterbg 2][#]I'm so happy!",

    "Antoine.Mail.Shane.NoRelationship": "Dear @, ^^Shane seems to have a lot more energy lately, and he's been smiling a lot more too! Being friends with you has helped him a lot, and it makes me so happy to see him feeling better. You really do a lot around here, you know? You make such a positive difference in everyone's lives. I hope you know that they all really appreciate it. You should hear them talk about you when you're not around!^^If there's anything I can do for you, just tell me. It's a lot of work supporting others if you don't have someone to support you too. I want to help you whenever I can.^^Sincerely, Antoine[letterbg 2][#]Shane looks so much better!",

    "Antoine.Mail.Shane.HasRelationship": "Dear @,^^Shane seems to have a lot more energy lately, and he's been smiling a lot more too! Being friends with you has helped him a lot, and it makes me so happy to see him feeling better. You really do a lot around here, you know? You make such a positive difference in everyone's lives. I hope you know that they all really appreciate it. You should hear them talk about you when you're not around!^^If there's anything I can do for you, just tell me. It's a lot of work supporting others, and I'm happy you have someone who supports you too. I want to help them and you whenever I can.^^Sincerely, Antoine[letterbg 2][#]Shane looks so much better!",

    "Antoine.Mail.Cordial": "Dear @,^^I had a dream last night that I was drifting among the trees of my old home and there was this scent that was pulling me through the branches. It was fresh and biting, but had the faintest notes of sweetness. Then I could hear the humming of old women and the clinking of glass. I glided slowly towards the sound, the smell getting stronger as I went, and then I saw it. Little old ladies in big hats and flower print dresses giggling and pouring this delicious looking drink into their glasses. When I woke up I remembered where I knew that taste from! ^^They used to make all sorts of drinks and desserts and foods with this citrus fruit in it. I remember wanting to taste those things so badly, but discerning flavor wasn't really something I was blessed with before. Now that I can, I'm so excited that I'll finally get to savor those delicious smelling things!^^The first thing I did this morning was try and make that drink those old ladies were having. I didn't really succeed, but I think it's because the fruit I remember doesn't grow here. Shame.^^Sincerely, Antoine[letterbg 2][#]Memories of citrus.",

    "Antoine.Mail.SouthernTea": "Dear @,^^I was talking with Aideen and something she said reminded me of another nice drink from my old home. The tea leaves were different there, and the tea they made was brown instead of green. I also usually saw people drinking it with ice cubes inside! Of course they also added a bit of citrus too.^^Aideen and I spent a lot of time seeing if we could recreate it here. Turns out green tea and black tea are really different. ^^Sincerely, Antoine^^^P.S. Aideen said she would get me some black tea leaves so I can recreate it properly. I think I might have to be selfish and keep them all for myself though. Sorry![letterbg 2][#]Have you tried tea with ice before?",

    //Note: This only gets sent in winter.
    "Antoine.Mail.Cold": "Dear @,^^It's too cold! I've been practically living inside my fireplace and my bones are still chilly. My throat was all scratchy too! I wanted to mix up a hot drink, but I was out of chocolate powder. I did have some things for tea though that Aideen gave me. So I mixed them together and I couldn't really taste it. I think my nose is too stuffy. ^^Sincerely, Antoine[letterbg 2][#]TOO COLD",


    /*/----------Event Specific----------/*/

    "Antoine.Mail.ThanksNote": "Dear @, ^^Thanks so much for helping me talk to my family! It went really well, and I'm so happy. If not for you I never would have taken that chance! So thank you! I wanted to give you something nice too. I hope you really enjoy it. The next time you come and see me, if my family is there, you can say hi! I made sure they understand you're a very good human.^^Sincerely, Antoine[letterbg 2][#]Thank you!",



    /*/----------Recipe Sharing Letters----------/*/

    //Conditions: Gifted Food Item 
    "Antoine.Mail.RecipeAdventure": "Dear @, ^^ Thanks so much for your tasty gift! It really inspired me to try and cook the dish myself. I messed it up so I'm too embarassed to send it though.^ If you give me another one I won't chicken out this time though and definitely send you one back. Also to test how well food ships in the mail. Let me know if it's all cold or smooshed!^ Sincerely, Antoine[letterbg 2][#]The beginning of our cooking adventure!",

    //Conditions: Gifted Omelet
    "Antoine.Mail.RecipeOmelet": "Dear @, ^^ I just watched the best show called the Queen of the Sauce! I really enjoyed trying her omelet technique! ^I noticed that it was really similar to the omelet recipe you sent me. Are you a fan of hers too? ^   Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Omelet",

    //Conditions: Gifted Parsnip Soup
    "Antoine.Mail.RecipeParsnipSoup": "Dear @, ^^ Caroline's parsnip soup is just the best. She really puts a lot of love in it. ^ And by love I mean salt, ha ha. I didn't use quite as much. ^   Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Parsnip Soup",

    //Conditions: Gifted Vegetable Medley
    "Antoine.Mail.RecipeVegetableMedley": "Dear @, ^^ I'm in love with the vegetable combination that Caroline puts in her vegetable medley! I had to make extra just to have some again later. ^   Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Vegetable Medley",

    //Conditions: Gifted Algae Soup
    "Antoine.Mail.RecipeAlgaeSoup": "Dear @, ^^ You know, some people really get put off by algae's odd texture. I really like it though, and Clint was really clever with it. ^   Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Algae Soup",

    //Conditions: Gifted Bean Hotpot
    "Antoine.Mail.RecipeBeanHotpot": "Dear @, ^^ Something about Clint's bean hotpot really draws you in. I got a lot of extra energy after trying it too. ^ Who would have thought Clint would have it in him, huh? ^   Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Bean Hotpot",

    //Conditions: Gifted Roots Platter
    "Antoine.Mail.RecipeRootsPlatter": "Dear @, ^^ I guess spending so much time in the mines really gave you some inspiration. ^ It was super tasty, and I'm definitely going to make some again later! ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Roots Platter",

    //Conditions: Gifted Squid Ink Ravioli
    "Antoine.Mail.RecipeSquidInkRavioli": "Dear @, ^^ This is such a clever use of squid ink! But I didn't have any from squid so I just used regular ink. ^ Ha ha, just kidding. I wish I could have seen your face. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Squid Ink Ravioli",

    //Conditions: Gifted Fried Mushroom
    "Antoine.Mail.RecipeFriedMushroom": "Dear @, ^^ Demetrius' fried mushrooms are so tasty. I never would have thought to cook them this way! ^ I managed to pick the mushrooms super fresh too. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Fried Mushroom",

    //Conditions: Gifted Autumn's Bounty
    "Antoine.Mail.RecipeAutumnsBounty": "Dear @, ^^ YAMS! I used so many of them in my version of this dish! Demetrius really knows his stuff. ^ Don't worry, there isn't nearly as much yam in yours, ha ha. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Autumn's Bounty",

    //Conditions: Gifted Ginger Ale
    "Antoine.Mail.RecipeGingerAle": "Dear @, ^^ Wow, a dwarf recipe. This must be pretty special. It tastes good too. ^ What do you mean it cost you 1,000g?! ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Ginger Ale",

    //Conditions: Gifted Salad
    "Antoine.Mail.RecipeSalad": "Dear @, ^^ Ah, Emily said she sent you her salad recipe. I'm a big fan of it too. Ha ha, no surprise there, huh? ^ I tried a different dressing than what she tends to use. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Salad",

    //Conditions: Gifted Red Plate
    "Antoine.Mail.RedPlate": "Dear @, ^^ This dish is pretty good for you. Just, uh, don't eat too much of it all at once. ^ Everyone digests things ... a little different. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Red Plate",

    //Conditions: Gifted Cookie
    "Antoine.Mail.Cookie": "Dear @, ^^ Evelyn gave you her cookie recipe?! They so good! ^ I've sort of been eating them non-stop. I managed to save you these though. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Cookie",

    //Conditions: Gifted Rice Pudding
    "Antoine.Mail.RicePudding": "Dear @, ^^ I'm not so sure how I feel about the sweetness of this one. Maybe I didn't follow the recipe right? ^ At least it's fun to eat though. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Rice Pudding",

    //Conditions: Gifted Farmer's Lunch
    "Antoine.Mail.FarmersLunch": "Dear @, ^^ Any good farmer needs a good farmer's lunch. This is such a clever way of jazzing up an omelet. ^ The Queen would be proud! ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Farmer's Lunch",

    //Conditions: Gifted Seafoam Pudding
    "Antoine.Mail.SeafoamPudding": "Dear @, ^^ Well this one was certainly interesting. I guess when you're out at sea you really have to work with what you've got. ^ Sorry if this one is a bit ... thick. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Seafoam Pudding",

    //Conditions: Gifted Dish O' The Sea
    "Antoine.Mail.DishOTheSea": "Dear @, ^^ Fish and hashbrowns were not a combination I'd considered before, but it really works! ^ I'm not sure how you're supposed to keep it from getting soggy though. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Dish O' The Sea",

    //Conditions: Gifted Survival Burger
    "Antoine.Mail.SurvivalBurger": "Dear @, ^^ Ha ha, I'm not sure I could call this one a burger, but it's definitely a tasty sandwich! ^ I can see how it might want you to go out and find more to eat though. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Survival Burger",

    //Conditions: Gifted Fried Eel
    "Antoine.Mail.FriedEel": "Dear @, ^^ Evelyn isn't the only chef in the family! This fried eel was a little bit greasy but great! ^ I tried to soak some of the extra grease off with a paper towel. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Fried Eel",

    //Conditions: Gifted Spicy Eel
    "Antoine.Mail.SpicyEel": "Dear @, ^^ This one has some kick to it! It really puts a fire in your belly. ^ Just be careful not to get too much fire down there. It has to come out sometime. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Spicy Eel",

    //Conditions: Gifted Tropical Curry
    "Antoine.Mail.TropicalCurry": "Dear @, ^^ The pineapple bowl is such an interesting touch, but I'm not sure how it really enhances the curry. ^ Hot pepper and coconut are also a bit ... I'm sorry you paid how much for this? ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Tropical Curry",

    //Conditions: Gifted Salmon Dinner
    "Antoine.Mail.SalmonDinner": "Dear @, ^^ Wow, Gus definitely knows what he's doing. This was the best salmon dish I've ever made. ^ I hope you'll agree. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Salmon Dinner",

    //Conditions: Gifted Cranberry Sauce
    "Antoine.Mail.CranberrySauce": "Dear @, ^^ I guess the only way some people can eat cranberries is if you cook them with a lot of sugar. ^ I don't really mind the bitterness myself, but having it sweet is nice sometimes too. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Cranberry Sauce",  

    //Conditions: Gifted Triple Shot Espresso
    "Antoine.Mail.TripleShotEspresso": "Dear @, ^^ This was so strong! I've been shaking all morning! I don't like it! ^ Here, you can just have all of it. I hope it was worth the money. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Triple Shot Espresso",

    //Conditions: Gifted Banana Pudding
    "Antoine.Mail.BananaPudding": "Dear @, ^^ You got this recipe from a mysterious bird for a bunch of bone fragments? ^ Well it's definitely tasty! So it was worth it! I added little vanilla cookies to mine. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Banana Pudding",

    //Conditions: Gifted Fried Calamari
    "Antoine.Mail.FriedCalamari": "Dear @, ^^ Jodi's fried calamari is really chewy. It's definitely a whole experience. ^ I hope it's one you enjoy. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Fried Calamari",

    //Conditions: Gifted Ice Cream
    "Antoine.Mail.IceCream": "Dear @, ^^ I've never made ice cream before, I didn't realize it was so simple! ^ It's a little cold for my liking, but on a really hot day I guess it'd be nice! ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Ice Cream",

    //Conditions: Gifted Crispy Bass
    "Antoine.Mail.CrispyBass": "Dear @, ^^ Kent is full of surprises. One of them being he knows how to cook a mean bass dish. ^ I managed to get it extra crispy too. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Crispy Bass",

    //Conditions: Gifted Super Meal
    "Antoine.Mail.SuperMeal": "Dear @, ^^ This one definitely gives you a lot of energy! I guess Kent really needed that before. ^ I'm glad he can finally start to relax some. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Super Meal",

    //Conditions: Gifted Poi
    "Antoine.Mail.Poi": "Dear @, ^^ Little Leo came up with this all by himself? It's sweeter than I expected. ^ He should be really proud! ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Poi",

    //Conditions: Gifted Mango Sticky Rice
    "Antoine.Mail.MangoStickyRice": "Dear @, ^^ This was a lot more complex than I expected from Leo, but it sure tastes good! ^ I think mango might just be one of my favorite fruits these days. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Mango Sticky Rice",

    //Conditions: Gifted Spaghetti
    "Antoine.Mail.Spaghetti": "Dear @, ^^ I didn't know Lewis could make a spaghetti that didn't come out of a jar. Good for him! ^Making the noodles was kind of hard, but I think they turned out well. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Spaghetti",

    //Conditions: Gifted Eggplant Parmesan
    "Antoine.Mail.EggplantParmesan": "Dear @, ^^ So, I heard this was supposed to have cheese in it? With Lewis going to Marnie's Ranch all the time you'd think he'd have plenty of it. ^ I had to grow a large eggplant for this one, and Juliet wanted to take a bunch of pictures of it. She must have been so proud! ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Eggplant Parmesan",

    //Conditions: Gifted Sashimi
    "Antoine.Mail.Sashimi": "Dear @, ^^ Raw fish is so good. Linus definitely knows what he's doing. ^ I managed to get these sliced extra thin. They're very delicate. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Sashimi",

    //Conditions: Gifted Fish Taco
    "Antoine.Mail.FishTaco": "Dear @, ^^ When I told Abigail I was eating a fish taco she started laughing. I don't really understand why. Linus did a good job with the recipe. ^  Sincerely, Antoine[letterbg 2] %item 195 1 %% [#]Fish Taco"







/*//Heart Event Ideas
{0-Heart (Introduction)
}

{3-Heart
Day - Sunny - Cindersnap Forest
Actors: Antoine, Farmer, Junimo
Dependency: Must have seen 0 Heart Introduction
Note: This taking place in the secret woods is not important. The event can be relocated.

Script
//The farmer finds Antoine in the forest in the rain, the sounds of junimo meeps can be heard. Antoine walks off screen in the direction of the deep woods and the farmer follows him. Now inside the deep woods (avoid having the farmer walk through the entrance in case they haven't unlocked it yet) Antoine is gone and instead there are just junimo chatting together. 

Red: "You should come home, we all miss you."
Yellow: "Yeah! We miss you!"
Green: "We miss your magic too! That magic is fun!"
Red: "You'll come home and teach us magic, right?"
Pink: "I don't want to go home yet. I still have a lot to learn!" 
Red: "Why do you have to learn from humans?"
Yellow: "Yeah!"
Red: "Yeah!"
Pink: "Because I'm  I just want to be with humans."
Red: "But why? They can't see us."
Green: "And they're messy." 
Yellow: "And stinky!"
Pink: "I don't think they're that bad, and some humans can see us."
Red: "The wizard? They're weird."
Yellow: "And they took one of our friends!"
Green: "Yeah, it really scared them being in one place and then suddenly in a totally different one."
Pink: "The wizard did send our friend back."
Green: "Yeah, but they were never the same."
Red: "Never the same!"
Yellow: "Eeek! I think that human is looking at us!"
Green: "It can see us! Run away!"
Red: "Run away!"

//The junimo run away. Pink remains behind to stare at the farmer.

Pink: "Hi, @. Um, just wait right here. Okay?"

//Pink leaves the screen, the sound of rustling bushes and magic place, then Antoine enters

An: "Sorry, I was told that I shouldn't change in front of people.$0" 
An: "Or was it get changed?$7"
An: "Anyway, I guess you're probably confused. But ... we're friends, right, @? I can probably tell you.$h"
An: "That was my family just now. I like to come here and visit them when I have the chance to.$0"
An: "They followed me all the way here. They care about me a lot, but ... well they think I'm just here to learn new magic from humans.$0"
An: "I, um, I'm not sure how to explain it. I just don't really think of myself as a junimo? I know I was created as one, but I can just feel deep down that I'm not.$u"
An: "The druid in Turnabout was the only person willing to help me. I went to wizards and witches from all over and all of them said it was too dangerous.$s"
An: "But that druid He said yes. He gave me this body and taught me how to maintain it with magic. We weren't even friends. He just saw something in need and  helped it.$h"
An: "It might sound silly, but I know my family won't understand any of this. So I've been telling them I'm pretending to be a human. That I got a human body to let other people see me. But I'm not pretending. I am human. $0"
An: "Don't tell this to a lot of people though. I don't want people to look at me and just think about what I was before.$s"
An: "Do you understand where I'm coming from, @?$7"
An: "I mean, I guess it doesn't matter if you do. So long as you don't think of my as anybody but Antoine.$h"
An: "Thanks for being so understanding. Do you want to hang out for a while? I'll walk you home after.$h"

The farmer stumbles on a conversation between junimo and learns something about Antoine.}

{6-Heart
}

{8-Heart
}

{10-Heart
}

{?-Heart
Night - Any Weather - Antoine's Treehouse
Actors: Antoine, Junimos, Farmer
Dependency: Must have seen Heart Events 3, 6, and 8

Script
Letter: Hi, @! Could you come by my place tonight? I'd like your help with something big! Thanks in advance! Antoine.

An: "Hey! You made it! Thanks for coming by. I invited my family here tonight and I want to tell them the truth about me. I was really hoping you'd come because I kind of need the emotional support. Don't worry, you won't have to say or do anything. Just be here.$h"

Blue: "We're here! We're here!"
Yellow: "You want to come home now, right?"
Green: "Yay! You're done learning magic!"
An: "Sorry, that isn't what this is about.$s"
Blue: "It's not?"
Green: "Oh, what is it?"
Yellow: "Yeah! What is it?!"
An: "Well. Um. So. I wanted to explain$s"
Green: "What is it?"
Yellow: "Yeah, you're being weird."
An: "So. I'm human.$s"
Blue: "Duh. That's pretty obvious."
Yellow: "Yeah!"
An: "No, I mean. Not just right now. I am. Just always have been.$6"
Junimo: "???"
Blue: "That's cool! You're a cool human!"
Green: "Why would you want to be human?"
Yellow: "Wait. So we're not learning magic?"
An: "I'll still teach you guys more magic. Don't worry.$h"
Junimo: "YAY! Awesome!"
An: (laughs)

Letter Received After the Event
@! Thanks so much for helping me talk to my family! It went really well, and I'm so happy. If not for you I never would have taken that chance! So thank you! I wanted to give you something nice too. I hope you really enjoy it. The next time you come and see me, if my family is there, you can say hi! I made sure they understand you're a very good human.
A gift is attached.

Antoine sends the farmer a letter inviting them to his house that night. He wants to tell his family that he's really human, and he needs some emotional support.}

//Extra Heart Events (Pelican Town)
{0-Heart (Wizard)

Day - Raining - Cindersnap Forest
Actors: Antoine, Wizard, Farmer
Dependency: Must have seen Heart Events 3

Script
Wizard: "You really should be more careful. I know you just want to help, but a lot of people fear what they don't understand, and magic is a complicated art that most can't comprehend.$0"
An: "You don't give them enough credit! Everyone I've shown magic has been very accepting and curious.$a"
Wizard: "For now, but eventually they'll become greedy and fearful, and if things go poorly, you'll be the first one they blame.$0"
An: "I don't think they'd blame me.$s"
Wizard: "They'll blame anything that isn't themselves, but if you're so determined, at least slow down on how much you cast. If you keep going at this rate you'll end up shortening your lifespan drastically.$0"
An: "I know that. I think it'll be worth it.$0"
Wizard: "You just feel that way because you're young. When you get closer to the end of your life you'll regret that you didn't take care to give yourself more time.
An: I don't mean any offense, but you have no idea what you're talking about.$8"
Wizard: "Hmm, I suppose I'll leave you to that opinion then. Don't say you weren't warned.$0" (teleports away)
An: (expresses the ellipses emote and then turns and notices farmer) "Oh, ha ha, did you see that whole thing? The wizard did something very nice for me once, so now they feel a tad bit responsible for me.$0"
An: "It's a little annoying, but also  nice. Having someone care about you, even just a little bit, it feels good.$h"
An: "Don't make that face. I have plenty of people that care about me, don't worry! I just like to remind myself how nice it feels so that I never forget to care about other people.$0"
An: "I care about you too. You've been very kind to me, and I want you to know that it means a lot.$0"
An: "I need to walk back home now, but remember that you're always welcome to come over and just chat.$h"
An: "Bye, @. Thanks for listening to me. You're a really great listener.$h"

The Wizard and Antoine are butting heads.}

{?-Heart (Linus)
Night - Sunny - Mountains (Outside Linus' Tent, around his lit fire)
Actors: Antoine, Jessie, Linus
Dependency: Must have seen Heart Events 3 P2

Script
Linus: "It's nice to have another like-minded person in town.$h"
An: "I like being part of a big bustling community, it's really refreshing.$h"
Linus: "I found the city to be very unpleasant. The people in the town are nice enough, but when too much brick and mortar choke out the grass, it just turns into chaos.$0"
Jessie: "I find myself in a bit of a middle ground, I suppose. I love being around other people, but nature is wonderful too. It's really hard to have both at the same time though.$0"
An: "I like the people here a lot, but it does make me sad to see how they choose to live sometimes. So disconnected from the world around them.$0"
Linus: "That is the folly of civilization. The conveniences it brings often overshadow the wisdom whispered through the trees.$0"
Linus: "Why contemplate the rock's journey as the stream shapes it slowly into something new when the glow of a screen brings such instant satisfaction.$0"
Jessie: "A lot of the people in town take time to enjoy nature, Linus, but they aren't obligated to make it their sole focus.$0"
Linus: "It is not an obligation. It is a choice that they make each day. Their wisdom and growth is shaped by what they use to make their world.$0"
An: "I've spent my whole life living deep among the trees. A much longer time than many humans can really make claim to.$0"
An: "Nature is beautiful, but it is also ruthless. It doesn't care for the wellbeing of the rabbit that rustles in its grass.$0"
An: "Or the bear that catches salmon in the stream to get ready for the bitter winter.$0"
An: "I love nature with every fiber of my being, but there is a warmth, a kindness, that humans have that nature can't express.$h"
Linus: "That kindness comes with cruelty. Civilization will always be a double edged sword.$0"
Jessie: "One extreme is really no better than the other, is it? Without the sun to balance the rain a plant would never grow.$0"
Linus: "Very well put, Jessie.$h"
An: "Yeah. Luckily this town seems to have a good balance to it. Doesn't it? I'm really happy to be here.$h"
Antoine talks to Jessie and Linus about the nature of nature.}

//Extra Heart Events (PT Improvements)
{Special Event - Community Center Completed
Night - Any - Town (Outside of Joja-Mart's Ruins)
Actors: Antoine, Farmer

Script
An: "(ellipsis emote 0)"
An: "It's completely gone. Lightning can be very destructive."
An: "This was the source of a lot of grief for the people in town, I think most are happy to see it go.$s"
An: "I'm not sure how I feel about it."
An: "It gave people jobs, and a place to buy food, plus it had a refrigeration unit.$0" 
An: "I don't think Pierre is going to start bringing in frozen produce, and the only place to get milk around here is Marnie's ranch.$0"
An: "Oh, and your farm when you have cows.$0"
An: "It provided a lot of conveniences, but were the people there truly happy?$7"
An: "I always saw tired faces go in and out when they had that blue uniform on.$8"

Farmer: 
(Choice 1) "Honestly, good riddance. That place was a blight on the town."
An: "I'm not surprised you feel that way.$0"

(Choice 2) "Yeah, people were tired, but every job is stressful like that."
An: "I don't find what I do very stressful. I am very lucky to love what I'm doing, I think. $0"

(Choice 3) "Not everybody can just cheat by using magic."
An: "I understand how magic can look like cheating, but it does take a lot of work, you know. $h"

An: "JojaMart and Morris were demonized, and I'm not sure it was particularly earned.$s"
An: "You are the reason the town got any kind of improvements. No one else was lifting a finger.$s"
An: "Morris was a man with an unkind and disposition, but he was willing to get the work down for the town.$s"
An: "It would have cost money, but the town could have gotten it together if they were just willing to try.$s"
An: "It was a force of magic that helped you do what you did. If the junimo hadn't worked hard to bolster the community, would anyone else have done it?$s"
An: "I suppose I just don't understand why everyone had to be at odds. Morris and the people who worked here were also a part of the community.$s"
An: "They could have worked together.$s"
An: "(sad emote 28)"
An: "I should probably go home. Thanks for listening to me without judgment, @."
An: "I just need to  cool off for a while.$0"

Antoine talks to the Farmer about his complicated feelings towards the Joja-Mart.}

{Special Event - Joja-Mart Wins
Night - After Joja-Mart is closed for the day - Town (Outside of Joja-Mart)
Actors: Antoine, Farmer

Script
An: (facing the Joja-mart as he speaks to the farmer) "Are you happy, @?$8"
Farmer: "(question emote 4)"
An: "Does this place, even with the dark energies it pours into this town, does it make you happy? Does it make anyone happy?$8"
An: "Is my understanding of people really that limited, even now?$a" 
An: "Will I ever understand them? Am I even a person if I can't understand them?$6"

Farmer: 
	(Choice 1) "I am happy, yes. No one else was going to do anything to fix this town."
	An: "You're right about that, but the junimo were willing to try.$s"

	(Choice 2) "No, Joja-Mart doesn't make me happy. But it doesn't make me miserable either. It just kind of. Does both and neither of those things."
	An: "That is  very confusing, but thank you for trying to explain it. $0"
	
(Choice 3) "I never figured you for the existential crisis type."
An: "How else could I feel about this? I'm so connected to nature and the earth, and that building just existing is toxic for both things.$8"

An: (ellipsis emote 0)
An: "This place creates such dark energies. All I can feel when I am near it is the negativity that it pours into the town. I just can't - how can a place like this ever make anyone happy so long as it exists?$s"
An: "I want to understand, @. I really do. $s"
An: "I think I'm going to need some time to  consider this. Excuse me. $s"
Antoine is having an existential crisis and the farmer has some concerns.}

//Extra Heart Events (East Scarp)
{0-Heart (Rosa)
Day - Sunny - East Scarp Beach
Actors: Antoine, Rosa
Dependency: Must have seen 0 Heart Introduction

Script
Rosa: "Thanks for helping me get all the sand out of the gears, Antoine.$h"
An: "It's no trouble at all! My magic makes this really easy for me! I took care of some salt and rust too!$h"
Rosa: "Really? Thanks a lot! I was going to have to send it out to be repaired soon, but now I don't have to.$h"
An: "Nope! Is there anything else I can do for you?$0"
Rosa: "Nah, nothing for me, but I bet Aideen could use a hand. She's working herself too hard again.$0"
An: "Aideen? Whenever I ask her if she needs help she scowls at me.$s"
Rosa: "Maybe it's the way you're phrasing it. Instead of saying 'need help' try 'want help' you know? Women can be strange about implying they have to have the help of a man to get by.$h"
An: "Really? But you're a woman and you don't seem to mind my help.$7"
Rosa: "Sure, but I don't usually have men throwing themselves at me to win my favor either.$0"
An: "?$7"
Rosa: "Right, I'm just confusing you again, huh? Don't worry about it. Just ask Deen if she *wants* help next time.$h"
An: "Okay! I'll do that! Thanks!$h"
Rosa: "Sure. Hey, could you head over to the Inn and take a look at the refrigerator? I need to make sure it's still running.$0"
An: "Oh! I know this one! You'd better go catch it, right?$h"
Rosa: "Ha ha, just come with me.$h"
Antoine is using magic to help Rosa get sand out of the wheels of her cart.}

{0-Heart (Aideen)
Day - Any Weather - Inside Aideen's
Actors: Antoine, Aideen, Farmer
Dependency: Must have seen 0 Heart Introduction

Script
Aideen: "Hmmm. Not pink. Maybe blue?$0"
An: "Sure!$0"
Aideen: "No, that's not quite right either. Purple.$0"
An: "This flower isn't usually purple.$7"
Aideen: "No, but if we're using magic we might as well think out of the box, right?$h"
An: "Oh, I guess so.$0"
Aideen: "Is there a problem?$0"
An: "Well I'm not sure the flower wants to be purple. I think it prefers being a color it knows.$s"
Aideen: "Oh I'm sure any flower would be thrilled to get to be something new and exciting, don't you?$h"
An: "Um. Maybe. I guess I'll try it.$h"
Aideen: "Please.$0"
(magic cast)
Aideen: "Yellow? That's not quite purple.$0"
An: "Sorry, it must have wanted to try yellow.$9"
Aideen: "Right, well, if that's the best you can manage. Yellow is quite striking.$0"
An: "I think it likes being yellow best.$h"
Aideen: "I can be content with this. Why don't you go into the kitchen and have a snack. I have another arrangement I need to put together and I'm bursting with ideas for this new yellow flower.$0"
An: "Sure thing! Thanks for letting me help!$h"
Aideen: "Of course, of course.$0"
Antoine is using magic to help Aideen with her flowers, changing the color of them so that she can perfect her arrangement.}

{0-Heart (Jacob and Eloise)
Day - Sunny - Town Center
Actors: Antoine, Jacob, Eloise, Slime, Farmer
Dependency: Must have seen 0 Heart Introduction

Script
Jacob: "How did you even find something like this?$0"
An: "I was exploring the orchard and found it in that abandoned house. Can you help it?$7"
Jacob: "I don't know. Monsters aren't really in my wheelhouse. Maybe that wizard in Cindersnap or Marlon$0"
An: "I can't go to them!$a"
Jacob: (Question mark emote)
An: "Sorry. I didn't mean to yell. I'm just really worried that they'll just see him as something to kill. Or worse. Experiment on.$8"
Jacob: "Right. Well. I'm not sure I can help you much.$0"
Eloise: (comes in frame and expresses an exclamation emote) "Is that a slime? Oh how cute!$h" (rushes over to pet it)
Jacob: "Wait! Don't!$0"
Eloise: (is stopped by Jacob)
Jacob: "Don't touch it.$0"
Eloise: "Huh? Why not? Antoine touched it to bring it here, didn't he?$0"
An: "I didn't touch it with just my hands. I used special gloves so I could do it without it hurting me.$0"
Eloise: "But if it can hurt people why did you bring him to daddy to help it?$0"
An: "Because it can't help that it hurts people. See, the membrane on the outside that keeps all the jelly in it has a coating that burns if you touch it. There are a lot of animals that have things like that to protect themselves from things that would want to hurt it. That doesn't mean we should be less kind when we see one hurt or in danger.$h"
Eloise: "Oh, okay, I understand. It looks a little dry. Maybe it needs some water?$h"
An: "That's a very good idea, Eloise. Thank you.$h" (casts magic to wet the slime)
Slime: (comes to life)
Eloise: "Ooh! That's much better!$h"
An: "I really should have thought to do that first.$h"
Eloise: "Oh, it's okay. Sometimes I don't think of really obvious things too.$h"
Jacob: "Are you planning to keep this thing?$0"
An: "Definitely not. It's still a wild monster, and it's just cruel to confine wild things.$0" "Thank you both for helping me!$h"
Jacob: "I didn't really do much, but you're welcome.$0"
Antoine brings Jacob a sick slime to look at.}
*/

}